#pragma once

// Name: Astroneer-SDK, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class Astro.Activation
// 0x0048 (0x0070 - 0x0028)
class UActivation : public UObject
{
public:
	struct FScriptMulticastDelegate                    OnActivate;                                               // 0x0028(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnDeactivate;                                             // 0x0038(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnChange;                                                 // 0x0048(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               m_bActive;                                                // 0x0058(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0059(0x0007) MISSED OFFSET
	TArray<struct FSignalActivationBinding>            Bindings;                                                 // 0x0060(0x0010) (ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.Activation");
		return ptr;
	}


	bool Update(bool active);
	void UnbindTo(class UActivation* Other);
	void Toggle();
	bool IsActive();
	void Deactivate();
	void BindTo(class UActivation* Other);
	void Activate();
};


// Class Astro.ActorAttachmentsComponent
// 0x00B8 (0x01A8 - 0x00F0)
class UActorAttachmentsComponent : public UActorComponent
{
public:
	unsigned char                                      MaxAttachedPlayerCount;                                   // 0x00F0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               UsePlanetCameraUp;                                        // 0x00F1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               AllowFreeCam;                                             // 0x00F2(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               DisableViewTargetChangeOnExit;                            // 0x00F3(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              EntryInterpolationTime;                                   // 0x00F4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              EntryInterpolationEaseOutExponent;                        // 0x00F8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              ExitInterpolationTime;                                    // 0x00FC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              ExitInterpolationEaseOutExponent;                         // 0x0100(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DetachGroundedTrace;                                      // 0x0104(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               CanEnter;                                                 // 0x0108(0x0001) (Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0109(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnSetLanded;                                              // 0x0110(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnEnterExit;                                              // 0x0120(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnActorCompletedEntry;                                    // 0x0130(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnActorCompletedExit;                                     // 0x0140(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<struct FAttachmentDefinition>               AttachmentDefinitions;                                    // 0x0150(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FAttachmentState>                    AttachmentStates;                                         // 0x0160(0x0010) (Net, ZeroConstructor, SaveGame)
	TArray<struct FAttachmentState>                    OldAttachments;                                           // 0x0170(0x0010) (ZeroConstructor)
	struct FScriptMulticastDelegate                    OnPerformAux1Action;                                      // 0x0180(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPerformAux2Action;                                      // 0x0190(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	uint32_t                                           ExitSuppressionCount;                                     // 0x01A0(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x01A4(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.ActorAttachmentsComponent");
		return ptr;
	}


	bool STATIC_TogglePlayerAttachedStorage(class APlayerController* Controller, class UStorageChassisComponent* storage, bool bImmediate, bool bForce, bool* Toggled);
	bool ToggleClickPlayerAttached(bool* Toggled);
	bool ToggleAttached(class AActor* Actor, bool setViewTarget, bool bImmediate, bool* Toggled);
	void SaveGameSerializeCustom(class UAstroSaveCustomArchiveProxy* proxy);
	void PushExitSuppression();
	void PopExitSuppression();
	void OnRep_Attachments();
	void OnAttachedActorDestroyed(class AActor* DestroyedActor);
	bool HasPlayer();
	bool HasController(class APlayController* Controller);
	bool HasClickPlayer();
	bool HasActor(class AActor* Actor, int* outIndex);
	class AActor* GetFirstAttachedActor();
	struct FTransform GetDetachTransform(int I);
	struct FTransform GetAttachTransform(int I);
	void FinishExiting(int I);
	void DetachAll(bool bImmediate);
	bool CanExit();
	TArray<class APlayController*> STATIC_AttachedArrayPlayers(TArray<class UActorAttachmentsComponent*> Attachments);
	bool STATIC_AttachedArrayHasPlayer(TArray<class UActorAttachmentsComponent*> Attachments);
	class UActorAttachmentsComponent* STATIC_AttachedArrayHasActor(TArray<class UActorAttachmentsComponent*> Attachments, class AActor* Actor, int* outIndex);
	class USceneComponent* STATIC_AttachedArrayAvailable(TArray<class UActorAttachmentsComponent*> Attachments, const struct FVector& Location);
	class UActorAttachmentsComponent* STATIC_ActorActorAttachmentsComponent(class AActor* Actor);
};


// Class Astro.ActorEntityLinkComponent
// 0x0048 (0x0138 - 0x00F0)
class UActorEntityLinkComponent : public UActorComponent
{
public:
	struct FAstroEntityDefinition                      EntityDefinition;                                         // 0x00F0(0x0030) (Edit, DisableEditOnInstance)
	struct FAstroDatumRef                              EntityRef;                                                // 0x0120(0x0010) (SaveGame)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0130(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.ActorEntityLinkComponent");
		return ptr;
	}


	bool IsSpawnedFromEntity();
	struct FAstroDatumRef GetEntityDatumRef(bool* bOutSuccess);
};


// Class Astro.ActorGateObjectComponent
// 0x00A0 (0x0190 - 0x00F0)
class UActorGateObjectComponent : public UActorComponent
{
public:
	unsigned char                                      bHasPlayerProximityEvent : 1;                             // 0x00F0(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAnimatesInOutroCinematic : 1;                            // 0x00F0(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x3];                                       // 0x00F1(0x0003) MISSED OFFSET
	float                                              PlayerProximityEventTriggerDistance;                      // 0x00F4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnFirstPlayerEncountered;                                 // 0x00F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPlayerEnteredProximity;                                 // 0x0108(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPlayerExitedProximity;                                  // 0x0118(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCanBeActivatedChanged;                                  // 0x0128(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnIsActivatedChanged;                                     // 0x0138(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FGateObjectReplicationData                  ReplicationData;                                          // 0x0148(0x0018) (BlueprintVisible, BlueprintReadOnly, Net)
	unsigned char                                      UnknownData01[0x18];                                      // 0x0160(0x0018) MISSED OFFSET
	class USphereComponent*                            ProximitySphereComponent;                                 // 0x0178(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	TArray<class USkeletalMeshComponent*>              SkeletalMeshes;                                           // 0x0180(0x0010) (ExportObject, ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.ActorGateObjectComponent");
		return ptr;
	}


	void OnRep_ReplicationData();
	void OnPlayerProximitySphereEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex);
	void OnPlayerProximitySphereBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnOutroCinematicStarted();
	void OnOutroCinematicCompleted();
};


// Class Astro.ActorHarvestableComponent
// 0x0188 (0x0278 - 0x00F0)
class UActorHarvestableComponent : public UActorComponent
{
public:
	TArray<struct FHarvestableItemSpawnerDefinition>   PrimaryItemSpawners;                                      // 0x00F0(0x0010) (Edit, ZeroConstructor)
	struct FRuntimeFloatCurve                          PrimaryItemNumberProbabilityCurve;                        // 0x0100(0x0078) (Edit)
	TArray<struct FHarvestableItemSpawnerDefinition>   SecondaryItemSpawners;                                    // 0x0178(0x0010) (Edit, ZeroConstructor)
	struct FRuntimeFloatCurve                          SecondaryItemNumberWithPrimaryItemsProbabilityCurve;      // 0x0188(0x0078) (Edit)
	struct FRuntimeFloatCurve                          SecondaryItemNumberNoPrimaryItemsProbabilityCurve;        // 0x0200(0x0078) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.ActorHarvestableComponent");
		return ptr;
	}

};


// Class Astro.ActorItemConverterComponent
// 0x0158 (0x0248 - 0x00F0)
class UActorItemConverterComponent : public UActorComponent
{
public:
	struct FScriptMulticastDelegate                    OnSystemMigrationCheckStarted;                            // 0x00F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnAuthorityItemConversionCompleted;                       // 0x0100(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnActiveConversionsAdded;                                 // 0x0110(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnActiveConversionsRemoved;                               // 0x0120(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnStateChanged;                                           // 0x0130(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnWantsToBeActiveChanged;                                 // 0x0140(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnViewDataChanged;                                        // 0x0150(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnReplicationDataInitialized;                             // 0x0160(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<struct FName>                               InputSlotNames;                                           // 0x0170(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FName>                               OutputSlotNames;                                          // 0x0180(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	class UClass*                                      ConversionFormulaType;                                    // 0x0190(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      OutputItemTypeList;                                       // 0x0198(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinPowerUnitProductionTime;                               // 0x01A0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxPowerUnitProductionTime;                               // 0x01A4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bEjectCompletedOutputItem;                                // 0x01A8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x01A9(0x0003) MISSED OFFSET
	float                                              OutputItemEjectionForce;                                  // 0x01AC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EInputManagementType                               InputSlotsOrganizationRuleType;                           // 0x01B0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bAutoActivateWhenConversionAvailable : 1;                 // 0x01B1(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bCannotProcessConversionsInParallel : 1;                  // 0x01B1(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bRequiresExplicitShutdown : 1;                            // 0x01B1(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bInputSlotsAreUnclickable : 1;                            // 0x01B1(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bOutputSlotIsUnclickable : 1;                             // 0x01B1(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bDetonatesVolatileInputItems : 1;                         // 0x01B1(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bShowOutputIndicatorsWhenSelectingRecipe : 1;             // 0x01B1(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bForceRecipeSelection : 1;                                // 0x01B1(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bCanUseActorItemComponentAsInput : 1;                     // 0x01B2(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bProduceOutputsToUniqueSlots : 1;                         // 0x01B2(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bKeepPartialOutputBetweenSaves : 1;                       // 0x01B2(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData01[0x5];                                       // 0x01B3(0x0005) MISSED OFFSET
	struct FItemConverterReplicationData               ReplicationData;                                          // 0x01B8(0x0030) (BlueprintVisible, BlueprintReadOnly, Net)
	struct FItemConverterReplicationData               PrevReplicationData;                                      // 0x01E8(0x0030) (BlueprintVisible, BlueprintReadOnly)
	TArray<struct FSlotReference>                      InputSlotRefs;                                            // 0x0218(0x0010) (ZeroConstructor)
	TArray<struct FSlotReference>                      OutputSlotRefs;                                           // 0x0228(0x0010) (ZeroConstructor)
	TWeakObjectPtr<class URecipeOrganizationRule>      RecipeOrganizationRule;                                   // 0x0238(0x0008) (ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class UOutputOrganizationRule>      OutputOrganizationRule;                                   // 0x0240(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.ActorItemConverterComponent");
		return ptr;
	}


	void OnReplicationDataChanged();
	void OnAuthorityRemovedActiveItemConversion(const struct FActiveItemConversion& activeConversion);
	void OnAuthorityAddedActiveItemConversion(const struct FActiveItemConversion& activeConversion);
	bool STATIC_IsItemConversionRecipeInputStatusValid(const struct FItemConversionRecipeInputStatus& ItemConversionRecipeInputStatus);
	bool STATIC_IsItemConversionInputItemStatusValid(const struct FItemConversionInputItemStatus& ItemConversionIngredientStatus);
	void HandleItemChangedInExternalResourceSlot(class APhysicalItem* changedItem);
	struct FRecipe GetSelectedOutputRecipe();
	class UClass* GetSelectedOutputItemType();
	struct FItemConversionRecipeInputStatus GetConversionRecipeInputStatus(const struct FRecipe& Recipe);
	void AuthoritySetSelectedOutputItemTypeIndex(int newIndex);
	void AuthoritySetExternalResourceProviderSlotsForPlayer(class AAstroCharacter* controllingPlayer);
	void AuthoritySetConverterWantsToBeActive(bool active);
	void AuthorityIncrementSelectedOutputItemTypeIndex(bool AllowIndexWrapping);
	void AuthorityHandleItemComponentChanged();
	EItemConverterState AuthorityGetItemConverterState();
	void AuthorityDecrementSelectedOutputItemTypeIndex(bool AllowIndexWrapping);
	void AuthorityCancelActiveConversions();
};


// Class Astro.ActorLockableComponent
// 0x0010 (0x0100 - 0x00F0)
class UActorLockableComponent : public UActorComponent
{
public:
	struct FScriptMulticastDelegate                    OnIsUnlockedChangedAuthority;                             // 0x00F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.ActorLockableComponent");
		return ptr;
	}


	void OnAuthorityLockedStateChanged(const struct FAstroDatumRef& lockableComponentRef, const struct FLockChangedEventMetadata& EventData);
};


// Class Astro.ActorLockComponent
// 0x0030 (0x0120 - 0x00F0)
class UActorLockComponent : public UActorComponent
{
public:
	struct FScriptMulticastDelegate                    OnIsUnlockedChangedAuthority;                             // 0x00F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnLockingMechanismOpenOrCloseAuthority;                   // 0x0100(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<class ULockingMechanismView*>               LockingMechanismViews;                                    // 0x0110(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.ActorLockComponent");
		return ptr;
	}


	void OnAuthorityLockingMechanismStateChanged(class ULockingMechanism* changedLockingMechanism, const struct FLockChangedEventMetadata& EventData);
	void OnAuthorityLockedStateChanged(const struct FAstroDatumRef& lockComponentRef, const struct FLockChangedEventMetadata& EventData);
};


// Class Astro.ActorResearchComponent
// 0x0100 (0x01F0 - 0x00F0)
class UActorResearchComponent : public UActorComponent
{
public:
	struct FScriptMulticastDelegate                    OnWantsToResearchChanged;                                 // 0x00F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnIsResearchingChanged;                                   // 0x0100(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnResearchSubjectListChanged;                             // 0x0110(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnResearchReplicationDataChanged;                         // 0x0120(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnResearchStateChanged;                                   // 0x0130(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnAuthorityChangedActiveResearchSubjects;                 // 0x0140(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnActiveResearchSubjectExpiredAuthority;                  // 0x0150(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<struct FName>                               ResearchSlotNames;                                        // 0x0160(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              ResearchPowerRequired;                                    // 0x0170(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinimumResearchPowerFraction;                             // 0x0174(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinimumResearchRateMultiplier;                            // 0x0178(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x017C(0x0004) MISSED OFFSET
	class UCurveFloat*                                 UnderPoweredResearchRateCurve;                            // 0x0180(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaximumResearchPowerMultiplier;                           // 0x0188(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaximumResearchRateMutliplier;                            // 0x018C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UCurveFloat*                                 OverPoweredResearchRateCurve;                             // 0x0190(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bResearchSlotsUnclickableWhileActive;                     // 0x0198(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDestroyActiveResearchSubjectsOnInterruption;             // 0x0199(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x019A(0x0002) MISSED OFFSET
	float                                              ExpiredResearchSubjectDestructionDelay;                   // 0x019C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FResearchReplicationData                    ResearchReplicationData;                                  // 0x01A0(0x0020) (BlueprintVisible, BlueprintReadOnly, Net, Transient)
	unsigned char                                      UnknownData02[0x20];                                      // 0x01C0(0x0020) MISSED OFFSET
	TArray<struct FSlotReference>                      ResearchSlotRefs;                                         // 0x01E0(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.ActorResearchComponent");
		return ptr;
	}


	void OnRep_ResearchData();
	bool AuthorityStartOrInterruptResearch(class APlayController* InstigatingController);
	void AuthorityChangedActiveResearchSubjects(const struct FAstroDatumRef& ResearchComponentRef, TArray<struct FAttachedResearchSubject> ActiveResearchSubjects);
	void AuthorityActiveResearchSubjectExpired(const struct FAstroDatumRef& ResearchComponentRef, const struct FAttachedResearchSubject& ExpiredAttachedResearchSubject);
};


// Class Astro.SingleUseConsumableComponent
// 0x0040 (0x0130 - 0x00F0)
class USingleUseConsumableComponent : public UActorComponent
{
public:
	unsigned char                                      bHasBeenConsumed : 1;                                     // 0x00F0(0x0001) (Net, Transient)
	unsigned char                                      bSuppressUseAfterConsumption : 1;                         // 0x00F0(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bSuppressExamineAfterConsumption : 1;                     // 0x00F0(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x7];                                       // 0x00F1(0x0007) MISSED OFFSET
	class UParticleSystem*                             ConsumptionVFX;                                           // 0x00F8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FComponentReference                         VFXSpawnComponent;                                        // 0x0100(0x0018) (Edit, DisableEditOnInstance)
	struct FName                                       VFXSpawnSocketName;                                       // 0x0118(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FString                                     ConsumptionAudioEventName;                                // 0x0120(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.SingleUseConsumableComponent");
		return ptr;
	}


	void OnRep_HasBeenConsumed(bool bWasConsumed);
};


// Class Astro.ActorResearchPointGrantComponent
// 0x0008 (0x0138 - 0x0130)
class UActorResearchPointGrantComponent : public USingleUseConsumableComponent
{
public:
	float                                              MinPointsGranted;                                         // 0x0130(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxPointsGranted;                                         // 0x0134(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.ActorResearchPointGrantComponent");
		return ptr;
	}

};


// Class Astro.TerrainModifierBase
// 0x13B0 (0x1660 - 0x02B0)
class UTerrainModifierBase : public USceneComponent
{
public:
	bool                                               Enabled;                                                  // 0x02B0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x02B1(0x0003) MISSED OFFSET
	int                                                SeedOffset;                                               // 0x02B4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                EvaluationDepth;                                          // 0x02B8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                EdgeEvaluationDepth;                                      // 0x02BC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x13A0];                                    // 0x02C0(0x13A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.TerrainModifierBase");
		return ptr;
	}

};


// Class Astro.TerrainModifierLocal
// 0x0000 (0x1660 - 0x1660)
class UTerrainModifierLocal : public UTerrainModifierBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.TerrainModifierLocal");
		return ptr;
	}

};


// Class Astro.TerrainPlacementComponent
// 0x0010 (0x1670 - 0x1660)
class UTerrainPlacementComponent : public UTerrainModifierLocal
{
public:
	int                                                OctreeResOffset;                                          // 0x1660(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               AllowDecoratorOverlaps;                                   // 0x1664(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x1665(0x0003) MISSED OFFSET
	float                                              ExclusionRadius;                                          // 0x1668(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x166C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.TerrainPlacementComponent");
		return ptr;
	}

};


// Class Astro.ActorSelectorComponent
// 0x0010 (0x1680 - 0x1670)
class UActorSelectorComponent : public UTerrainPlacementComponent
{
public:
	TArray<class UClass*>                              Actors;                                                   // 0x1670(0x0010) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.ActorSelectorComponent");
		return ptr;
	}

};


// Class Astro.ActorSolarPowerGeneratorComponent
// 0x0068 (0x0158 - 0x00F0)
class UActorSolarPowerGeneratorComponent : public UActorComponent
{
public:
	struct FComponentReference                         CastComponentRef;                                         // 0x00F0(0x0018) (Edit, DisableEditOnInstance)
	struct FComponentReference                         SunFacingSolarPanelRef;                                   // 0x0108(0x0018) (Edit, DisableEditOnInstance)
	float                                              MinPowerOutput;                                           // 0x0120(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxPowerOutput;                                           // 0x0124(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      SolarPanelShouldTrackSun : 1;                             // 0x0128(0x0001) (Edit, DisableEditOnInstance)
	ESolarGeneratorSunTrackingBehavior                 SunTrackingBehavior;                                      // 0x0129(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x012A(0x0002) MISSED OFFSET
	float                                              SunFacingRotationLimit;                                   // 0x012C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SolarPanelRotatorInterpolationStrength;                   // 0x0130(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0134(0x0004) MISSED OFFSET
	class USceneComponent*                             CastComponent;                                            // 0x0138(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class USceneComponent*                             SunFacingSolarPanel;                                      // 0x0140(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UPowerComponent*                             PowerComponent;                                           // 0x0148(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0150(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.ActorSolarPowerGeneratorComponent");
		return ptr;
	}


	void OnSpawnedInSlot();
	void OnReleasedFromSlot(bool NewOwner);
	void OnPlacedInSlot();
	void HandleStoppedGeneratingPower();
	void HandleStartedGeneratingPower();
	void HandlePickedUpFromWorld(bool PhysicalMovement);
	void HandleDroppedInWorld(class UPrimitiveComponent* Component, const struct FVector& Point, const struct FVector& Normal);
};


// Class Astro.ActorStreamingPowerCableComponent
// 0x0028 (0x0118 - 0x00F0)
class UActorStreamingPowerCableComponent : public UActorComponent
{
public:
	struct FScriptMulticastDelegate                    OnUpdateStreamingPowerCableVisualizationData;             // 0x00F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FStreamingPowerCableVisualizationData       StreamingPowerCableVisualizationData;                     // 0x0100(0x0010) (Net)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0110(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.ActorStreamingPowerCableComponent");
		return ptr;
	}


	void UpdateStreamingPowerCableVisualizationData__DelegateSignature(const struct FStreamingPowerCableVisualizationData& PowerCableVisualizationData);
	void SetDirectionalConnectionSplitRatio(float ratio);
	void OnSelfDestroyed(class AActor* Actor);
	void OnRep_VisualizationData();
	void MakeSlotConnection(const struct FSlotReference& From, const struct FSlotReference& To);
	void Disconnect();
};


// Class Astro.ActorStreamingPowerNodeComponent
// 0x0040 (0x0130 - 0x00F0)
class UActorStreamingPowerNodeComponent : public UActorComponent
{
public:
	struct FScriptMulticastDelegate                    OnUpdatePowerVisualization;                               // 0x00F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FStreamingPowerNodeVisualizationData        PowerVisualizationDataReplicated;                         // 0x0100(0x001C) (Net)
	bool                                               CanPropagateDirectionalConnectionSwaps;                   // 0x011C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x13];                                      // 0x011D(0x0013) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.ActorStreamingPowerNodeComponent");
		return ptr;
	}


	void UpdateStreamingNodePowerVisualization__DelegateSignature(const struct FStreamingPowerNodeVisualizationData& VisualizationData);
	void OnRep_VisualizationData();
};


// Class Astro.ActorWindPowerGeneratorComponent
// 0x0050 (0x0140 - 0x00F0)
class UActorWindPowerGeneratorComponent : public UActorComponent
{
public:
	float                                              DebugLineWindVectorVerticalOffset;                        // 0x00F0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DebugLineWindDirectionScale;                              // 0x00F4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnWindPowerAnimationDataChanged;                          // 0x00F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              MinPowerOutput;                                           // 0x0108(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxPowerOutput;                                           // 0x010C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WindSpeedAnimationInterpolationStrength;                  // 0x0110(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WindDirAnimationInterpolationStrength;                    // 0x0114(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FWindPowerGeneratorReplicationData          WindPowerAnimationData;                                   // 0x0118(0x0010) (Net)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0128(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.ActorWindPowerGeneratorComponent");
		return ptr;
	}


	void OnWindPowerAnimationDataChanged__DelegateSignature(const struct FVector& WindNormal, float WindSpeed);
	void OnRep_AnimatedWindVec();
};


// Class Astro.ActuatorComponent
// 0x0018 (0x0108 - 0x00F0)
class UActuatorComponent : public UActorComponent
{
public:
	struct FScriptMulticastDelegate                    OnActuate;                                                // 0x00F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class USlotsComponent*                             SlotsComponent;                                           // 0x0100(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.ActuatorComponent");
		return ptr;
	}


	void MulticastOnActuate();
	void AuthorityScheduleActuation(class APlayController* Instigator, float Delay);
};


// Class Astro.ActuatorQueue
// 0x0010 (0x0038 - 0x0028)
class UActuatorQueue : public UObject
{
public:
	TArray<struct FActuationRequest>                   PendingRequests;                                          // 0x0028(0x0010) (ZeroConstructor, SaveGame)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.ActuatorQueue");
		return ptr;
	}

};


// Class Astro.AdaptiveTickComponent
// 0x0010 (0x0100 - 0x00F0)
class UAdaptiveTickComponent : public UActorComponent
{
public:
	float                                              MinTickInterval;                                          // 0x00F0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxTickInterval;                                          // 0x00F4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FarTickDistance;                                          // 0x00F8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              NearTickDistance;                                         // 0x00FC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.AdaptiveTickComponent");
		return ptr;
	}

};


// Class Astro.AdaptiveTickGroup
// 0x01B8 (0x0560 - 0x03A8)
class AAdaptiveTickGroup : public AActor
{
public:
	TArray<class AAstroCharacter*>                     m_characters;                                             // 0x03A8(0x0010) (ZeroConstructor, Transient)
	TArray<struct FTickingObject>                      m_mobileObjects;                                          // 0x03B8(0x0010) (ZeroConstructor, Transient)
	TArray<struct FTickingObject>                      m_staticObjects;                                          // 0x03C8(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData00[0x188];                                     // 0x03D8(0x0188) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.AdaptiveTickGroup");
		return ptr;
	}

};


// Class Astro.TerrainModifier
// 0x0000 (0x1660 - 0x1660)
class UTerrainModifier : public UTerrainModifierBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.TerrainModifier");
		return ptr;
	}

};


// Class Astro.AdditiveModifier
// 0x0020 (0x1680 - 0x1660)
class UAdditiveModifier : public UTerrainModifier
{
public:
	class UTerrainBiomeProperties*                     BiomeProperties;                                          // 0x1660(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UBiomeHazards*                               BiomeHazards;                                             // 0x1668(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	TArray<class UTerrainModifierBase*>                ChildModifiers;                                           // 0x1670(0x0010) (ExportObject, ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.AdditiveModifier");
		return ptr;
	}

};


// Class Astro.AstroAchievements
// 0x0000 (0x0028 - 0x0028)
class UAstroAchievements : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.AstroAchievements");
		return ptr;
	}


	void STATIC_IncrementAchievementProgressForAllPlayers(EAstroAchievementKeys Achievement, int AddedProgress, class UObject* WorldContextObject);
	void STATIC_IncrementAchievementProgress(EAstroAchievementKeys Achievement, int AddedProgress, class APlayerController* Player);
	void STATIC_IncrementAchievementFloatProgressForAllPlayers(EAstroAchievementKeys Achievement, float AddedProgress, class UObject* WorldContextObject);
	void STATIC_IncrementAchievementFloatProgress(EAstroAchievementKeys Achievement, float AddedProgress, class APlayerController* Player);
	void STATIC_AwardAchievementForAllPlayers(EAstroAchievementKeys Achievement, class UObject* WorldContextObject);
	void STATIC_AwardAchievement(EAstroAchievementKeys Achievement, class APlayerController* Player);
	void STATIC_AddAchievementCollectionItemForAllPlayers(EAstroAchievementKeys Achievement, class UClass* Item, class UObject* WorldContextObject);
	void STATIC_AddAchievementCollectionItem(EAstroAchievementKeys Achievement, class UClass* Item, class APlayerController* Player);
};


// Class Astro.AchievementDefinitionTable
// 0x0040 (0x0070 - 0x0030)
class UAchievementDefinitionTable : public UDataAsset
{
public:
	TArray<struct FCountAchievement>                   CountAchievements;                                        // 0x0030(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FFloatCountAchievement>              FloatCountAchievements;                                   // 0x0040(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FItemCollectionAchievement>          ItemCollectionAchievements;                               // 0x0050(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FThresholdAchievementDefinition>     ThresholdAchievements;                                    // 0x0060(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.AchievementDefinitionTable");
		return ptr;
	}

};


// Class Astro.AstroAction
// 0x0050 (0x0078 - 0x0028)
class UAstroAction : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnActionEnded;                                            // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      RequiredResources;                                        // 0x0040(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      Priority;                                                 // 0x0041(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bInterruptedBySamePriority : 1;                           // 0x0042(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData01[0x1];                                       // 0x0043(0x0001) MISSED OFFSET
	struct FAstroActionIdentifier                      Identifier;                                               // 0x0044(0x0004) (IsPlainOldData)
	EAstroActionState                                  State;                                                    // 0x0048(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
	struct FAstroActionContext                         Context;                                                  // 0x0050(0x0018) (BlueprintVisible, BlueprintReadOnly)
	TArray<class UGameplayTask*>                       ActiveTasks;                                              // 0x0068(0x0010) (ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.AstroAction");
		return ptr;
	}

};


// Class Astro.AstroActionComponent
// 0x0018 (0x0180 - 0x0168)
class UAstroActionComponent : public UGameplayTasksComponent
{
public:
	TArray<class UAstroAction*>                        ActiveActions;                                            // 0x0168(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0178(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.AstroActionComponent");
		return ptr;
	}


	bool StartActionInstance(class UAstroAction* Action);
	bool StartAction(class UClass* ActionType);
	void ServerRequestStartAction(const struct FAstroActionRequestPayload& payload);
	void ServerRequestInterruptAction(const struct FAstroActionIdentifier& actionToInterruptIdentifier);
	void OnActionEnded(class UAstroAction* EndedAction);
	void MulticastStartAction(const struct FAstroActionRequestPayload& payload);
	void MulticastInterruptAction(const struct FAstroActionIdentifier& interruptedActionIdentifier);
	class UAstroAction* CreateAction(class UClass* ActionType);
	void ClientDenyStartActionRequest(const struct FAstroActionIdentifier& deniedActionIdentifier);
};


// Class Astro.AstroAIPawn
// 0x0028 (0x0430 - 0x0408)
class AAstroAIPawn : public APawn
{
public:
	class USceneComponent*                             TargetingOriginNode;                                      // 0x0408(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class USceneComponent*                             AttackOriginNode;                                         // 0x0410(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FRotator                                    AttackRotator;                                            // 0x0418(0x000C) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	bool                                               CalculateAttackRotatorOnlyInZ;                            // 0x0424(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsWarning;                                                // 0x0425(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0426(0x0002) MISSED OFFSET
	class UAstroActionComponent*                       ActionComponent;                                          // 0x0428(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.AstroAIPawn");
		return ptr;
	}

};


// Class Astro.AstroAnalytics
// 0x0000 (0x0028 - 0x0028)
class UAstroAnalytics : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.AstroAnalytics");
		return ptr;
	}


	void STATIC_RecordEventWithAttributes(const struct FString& EventName, TArray<struct FAnalyticsEventAttr> Attributes, class APlayerController* Player);
	void STATIC_RecordEventWithAttribute(const struct FString& EventName, const struct FString& AttributeName, const struct FString& AttributeValue, class APlayerController* Player);
	void STATIC_RecordEventResourceCollected(const struct FString& ResourceName, int Count, class APlayerController* Player);
	void STATIC_RecordEventPlanetfall(const struct FString& Planet, class APlayerController* Player);
	void STATIC_RecordEventItemUnlocked(const struct FString& Name, class APlayerController* Player);
	void STATIC_RecordEventItemCrafted(const struct FString& ItemType, int Count, class APlayerController* Player);
	void STATIC_RecordEventCustomization(const struct FString& Name, class APlayerController* Player, struct FString* Value);
	void STATIC_RecordEvent(const struct FString& EventName, class APlayerController* Player);
	void STATIC_AccumulateCounter(EAstroTelemetryCounter counter, float Value);
};


// Class Astro.AstroApplyTransformTask
// 0x00B8 (0x0120 - 0x0068)
class UAstroApplyTransformTask : public UGameplayTask
{
public:
	struct FScriptMulticastDelegate                    OnTransformCompleted;                                     // 0x0068(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0xA8];                                      // 0x0078(0x00A8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.AstroApplyTransformTask");
		return ptr;
	}


	void SetTargetRelativeTransform(const struct FTransform& targetRelativeTransform, class UCurveFloat* relativeTransformProgressCurve);
	class UAstroApplyTransformTask* STATIC_CreateAstroApplyTransformTask(class UAstroAction* OwningAction, const struct FName& TaskInstanceName, class USceneComponent* SceneComponent, float Duration, class UCurveVector* LocationCurve, class UCurveVector* RotationCurve, class UCurveVector* ScaleCurve);
};


// Class Astro.AstroAudioStatics
// 0x0000 (0x0028 - 0x0028)
class UAstroAudioStatics : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Astro.AstroAudioStatics");
		return ptr;
	}


	void STATIC_SetSwitch(const struct FName& SwitchGroup, const struct FName& SwitchState, class AActor* Actor);
	void STATIC_SetState(const struct FName& StateGroup, const struct FName& State);
	void STATIC_SetRTPCValue(const struct FName& RTPC, float Value, int InterpolationTimeMs, class AActor* Actor);
	int STATIC_PostEventAttached(const struct FString& EventName, class AActor* Actor, const struct FName& AttachPointName, bool bStopWhenAttachedToDestroyed);
	int STATIC_PostEventAtLocation(const struct FString& EventName, const struct FVector& Location, const struct FRotator& Orientation, class UObject* WorldContextObject);
	int STATIC_PostEvent(const struct FString& EventName, class AActor* Actor, bool bStopWhenAttachedToDestroyed);
};


// Class Astro.AstroCharacter
// 0x0498 (0x08A0 - 0x0408)
class AAstroCharacter : public APawn
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0408(0x0008) MISSED OFFSET
	class USceneComponent*                             BaseLocation;                                             // 0x0410(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              FallDampening;                                            // 0x0418(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CurrentSpeed;                                             // 0x041C(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	struct FVector                                     CurrentVelocity;                                          // 0x0420(0x000C) (BlueprintVisible, BlueprintReadOnly, Net, IsPlainOldData)
	struct FVector                                     LastTerrainNormal;                                        // 0x042C(0x000C) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	bool                                               Driving;                                                  // 0x0438(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               Dying;                                                    // 0x0439(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Walking;                                                  // 0x043A(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               SwappingItem;                                             // 0x043B(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x043C(0x0004) MISSED OFFSET
	class AActor*                                      DrivingActor;                                             // 0x0440(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class AActor*                                      AttachOwner;                                              // 0x0448(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FSlotReference                              HeavyCarryingSlot;                                        // 0x0450(0x0010) (BlueprintVisible)
	struct FComponentReference                         AddBrushReference;                                        // 0x0460(0x0018) (Edit, DisableEditOnInstance)
	struct FComponentReference                         SubtractBrushReference;                                   // 0x0478(0x0018) (Edit, DisableEditOnInstance)
	struct FComponentReference                         FlatBrushReference;                                       // 0x0490(0x0018) (Edit, DisableEditOnInstance)
	struct FComponentReference                         ColorPaintBrushReference;                                 // 0x04A8(0x0018) (Edit, DisableEditOnInstance)
	struct FComponentReference                         ColorPickerBrushReference;                                // 0x04C0(0x0018) (Edit, DisableEditOnInstance)
	bool                                               Jumped;                                                   // 0x04D8(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	bool                                               JumpInputReceived;                                        // 0x04D9(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x04DA(0x0006) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnCharacterCustomizationChanged;                          // 0x04E0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData03[0x10];                                      // 0x04F0(0x0010) MISSED OFFSET
	bool                                               Sprinting;                                                // 0x0500(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0501(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnLocalSolarBodyChanged;                                  // 0x0508(0x0010) (ZeroConstructor, InstancedReference)
	class UStaticMesh*                                 HoldingIndicatorMesh;                                     // 0x0518(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInterface*                          HoldingIndicatorMaterial;                                 // 0x0520(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UStaticMesh*                                 HoldingIndicatorDirMesh;                                  // 0x0528(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
