#pragma once

// Name: Astroneer-SDK, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass backpack_AnimBP.backpack_AnimBP_C
// 0x1338 (0x1708 - 0x03D0)
class Ubackpack_AnimBP_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x03D0(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_1739A052479E138E0DDE35BB722CECAD;      // 0x03D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_67B3BF594A6FBFA4D440689804D66DEB;// 0x0420(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D40CE906448C3F9632575D9B38DA2476;// 0x04A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_93A943DC46DD0936886856B87DFAC3CA;// 0x0520(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5919D1EB4901B0D1094D8899F3750F64;// 0x05A0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9EE3B944455D5D0805AF6CB745B99213;// 0x0620(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_34128CE04CC41201BB92AF8175BC262A;// 0x0690(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0DFF6E3643A73501C7F552A6B5BCBC8A;// 0x06D8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3090D9DC4874D109A7837CB3DF4C54D6;// 0x0748(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E62B1CE4487FA5F1C93FBB8B7B5BD1CC;// 0x0790(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_42A1CEC8428D5B76268073A576EEE7DF;// 0x0800(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EEF856994475244C0A846AAEBD135E7E;// 0x0848(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4A7D3BAA4551A66606C6EAABE8B916D6;// 0x08B8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B0E1C0D54E916E90E18C19B5DACFBD5B;// 0x0900(0x00D8)
	unsigned char                                      UnknownData00[0x8];                                       // 0x09D8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0D4CE13F48CE1FA90469C9808F4C015A;// 0x09E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_52D4B8CF44C5C3AA5D2EAEA7DE7CDD0B;// 0x0A60(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_262A4BC64A52037879642D81B0D03EDA;// 0x0AE0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EF66A2D948A7A91E584352BF7EBF051B;// 0x0B60(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7D70513E4FB439587FC0B7A05BBF4A5C;// 0x0BE0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_91561C074E95180532C5E4AC40413418;// 0x0C50(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9795EC984FDFDD7B32D173A78801AB6F;// 0x0C98(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F34559B14D9F3B7D3BFE888B0EF82513;// 0x0D08(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BC5C8C164A7AAB4AB4A2E3847B96429A;// 0x0D50(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8EEE702D418F5B6A34C8569F537C19D0;// 0x0DC0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0B3BA2534E68D8D6781A7C8900B904A4;// 0x0E08(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7ACE08244CE6EB116B602883E38BB33F;// 0x0E78(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_BE5999F84C9E6F027CC9038E421F4075;// 0x0EC0(0x00D8)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_7031C7044D5B7E32BAF13B8628DA490D;// 0x0F98(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_CD05398F462CD529ACC498B11AF5731E;// 0x0FD0(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_3BFA68BE4AB5A71263845A9CD9B57088;// 0x1048(0x0078)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77F994304D2FC40710E03CA9D8657815;// 0x10C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_53A1DC914052677FBF245AA68ACCD71C;// 0x1140(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F00877B44001F5A9E4BFF2BF73138F0C;// 0x11C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C5305B354AB3D039324152B015922B16;// 0x1240(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F3C24F4F4E2622EC1256D9B884C0B2AE;// 0x12C0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_73205BF649D2FABA879D1588E37509702;// 0x1330(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6EF15E024E1FB5D43412E1B35417E2D5;// 0x1378(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_827DA2784AFEA185AFC8B1A59A3388A3;// 0x13E8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5604D6D04A1C65FE91EB498BDA888670;// 0x1430(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_73205BF649D2FABA879D1588E3750970;// 0x14A0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FFAFBA904F530606FBD95AAE44E3AC94;// 0x14E8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_61BA26C643D1F2CEB8821398AB7604AF;// 0x1558(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6AD35B0D40C948E1AE96D4A4819CD81D;// 0x15A0(0x00D8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_88A98CEE42C857D22223EEBBEBF1C270;// 0x1678(0x0078)
	bool                                               LeftAuxSlotted;                                           // 0x16F0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               RightAuxSlotted;                                          // 0x16F1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               GotFirstTick;                                             // 0x16F2(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PrinterActive;                                            // 0x16F3(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsPrinterInTransition;                                    // 0x16F4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsLeftAuxInTransition;                                    // 0x16F5(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsRightAuxInTransition;                                   // 0x16F6(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x16F7(0x0001) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnAuxTransitionFinished;                                  // 0x16F8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass backpack_AnimBP.backpack_AnimBP_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_backpack_AnimBP_AnimGraphNode_TransitionResult_0D4CE13F48CE1FA90469C9808F4C015A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_backpack_AnimBP_AnimGraphNode_TransitionResult_EF66A2D948A7A91E584352BF7EBF051B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_backpack_AnimBP_AnimGraphNode_TransitionResult_77F994304D2FC40710E03CA9D8657815();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_backpack_AnimBP_AnimGraphNode_TransitionResult_53A1DC914052677FBF245AA68ACCD71C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_backpack_AnimBP_AnimGraphNode_TransitionResult_5919D1EB4901B0D1094D8899F3750F64();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_backpack_AnimBP_AnimGraphNode_TransitionResult_67B3BF594A6FBFA4D440689804D66DEB();
	void BlueprintBeginPlay();
	void OnSetItemLeft(class APhysicalItem* Item);
	void OnCrack();
	void OnClose();
	void OnReleaseItemLeft(class APhysicalItem* Item);
	void OnSetItemRight(class APhysicalItem* Item);
	void OnReleaseItemRight(class APhysicalItem* Item);
	void AnimNotify_OnPrinterClosed();
	void AnimNotify_OnLeftAuxDown();
	void AnimNotify_OnLeftAuxUp();
	void AnimNotify_OnPrinterOpened();
	void AnimNotify_OnRightAuxDown();
	void AnimNotify_OnRightAuxUp();
	void AnimNotify_OnLeftAuxStartTransition();
	void AnimNotify_OnRightAuxStartTransition();
	void AnimNotify_OnPrinterStartTransition();
	void ExecuteUbergraph_backpack_AnimBP(int EntryPoint);
	void OnAuxTransitionFinished__DelegateSignature();
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
