#pragma once

// Name: Astroneer-SDK, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BasePrinterT1_BP.BasePrinterT1_BP_C
// 0x19E2 (0x1DB2 - 0x03D0)
class UBasePrinterT1_BP_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x03D0(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_72F264104F068551E66DD5B2D09D7DBC;      // 0x03D8(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_D8ACD00D43EE0C81FDCA25965258DE17;// 0x0420(0x00E0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_16FD0A6F45DE70DF2098949D0A8ADDFF;// 0x0500(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A3BC30784AC41A541E65C68A11157512;// 0x0580(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FC5A679A4FA713C5A553E3A67640F3D7;// 0x0600(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6C3283B44FD55905B329FDAD55019391;// 0x0680(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0B962448462A198044F1E69C47DA99112;// 0x0700(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_086DC8AE41477287BAE5EBA16B5050B92;// 0x0770(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AFDDC43F4DD2AB65C9A78FB922BB85E52;// 0x07B8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C85FF7E44F082F2472FE62A771F67CB62;// 0x0828(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0B962448462A198044F1E69C47DA9911;// 0x0870(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_086DC8AE41477287BAE5EBA16B5050B9;// 0x08E0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AFDDC43F4DD2AB65C9A78FB922BB85E5;// 0x0928(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C85FF7E44F082F2472FE62A771F67CB6;// 0x0998(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B6DB1958415C0B945FF4A399E6F30E08;// 0x09E0(0x00D8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_3B9BB5224E2ABE8C55A547A83ADF373F;// 0x0AB8(0x0078)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_E49E1DD449D9CCBA6AFFEC913D964BEE;// 0x0B30(0x0038)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0B68(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6A3183AC43D62A33855861901C1C9E23;// 0x0B70(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1022C55340C2915409E9C8AA7DA8A8AB;// 0x0BF0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CC901A5843E0E649D2E88794E60B9733;// 0x0C70(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_97ECE8A646A9ADC8F777DDA8EA102C89;// 0x0CF0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A2FBC90B449CA5CB76E1A0A08F2A6095;// 0x0D70(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E23574984000A82CFFA8B19F5901B437;// 0x0DF0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_15F94F37463A795BB712E1A444107C25;// 0x0E70(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_662FA4354F76FCC5D1E87483FB2063A5;// 0x0EF0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0E625EA74D94C69D4B8D96A3229C34F6;// 0x0F70(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_803B26814A0F94F4CB1864B976264D70;// 0x0FF0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F18239EE4BF76EDFE50B9EA8A609B5B2;// 0x1070(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C4F6B6944DD14B48FC36DDAEC521E0A7;// 0x10F0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C8498C1D4421F19BBB9DDD89FAC20C7E2;// 0x1160(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BB9492F744EBC20F4FA7048F18EAEEA2;// 0x11A8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_91F1BF884D6925BE59C69DAF5C39A9482;// 0x1218(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CCF7CE5E4C6B9738F68CA1A07131456A;// 0x1260(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8E6E5FFA4D8E6B0FC1A0ECBADEFBDDBD;// 0x12D0(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5CF883BE47FDA55A41C438969559B0EA;// 0x1318(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_AC690DF54B0ECBAC19C7BCA3EA62C401;// 0x13D0(0x00B8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_43FCCFD8486024EC501757BC4FF5773E;// 0x1488(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_BF3AEAF3454C76A470C28ABF1FD43324;// 0x14D0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E38DBF064EB1A2FD65A4599557DC66C8;// 0x1518(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_938816144721FE23304B2BA0E2AB65EC;// 0x1588(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_9E763F084AE74655549B74B31ECCF251;// 0x15D0(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_94FFEC3D4DD17198F52F0296DE8A9558;// 0x1618(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_D17746E5419B5E3AA03A52B0A139302E;// 0x1660(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9377111B4BA266F17E78BAAC87DC67F7;// 0x1718(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B8EE14DB47BDF58858F5178E9BE0E04B;// 0x17D0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8508CD714AB764B65A7BD1B551860D3F;// 0x1840(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7AF9D2774F535456D18E24AB9509EAD6;// 0x1888(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B0B0B5214015194FE1A3DEB0B43FD3A3;// 0x1940(0x00B8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_38085A93459E5AA0DE514EB22517AA11;// 0x19F8(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_5889E94D422C055F08550CBCFDDE083D;// 0x1A40(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4DDC0FBF43107B5908DDCFA70CFB4CC1;// 0x1A88(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_866860BF415ADF9B2394078878700258;// 0x1AF8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B25FFBCA466A389F53BF9D8C61BA0DB4;// 0x1B40(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C8498C1D4421F19BBB9DDD89FAC20C7E;// 0x1BB0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F97F41A5432555856BEE88B91964ECB8;// 0x1BF8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_91F1BF884D6925BE59C69DAF5C39A948;// 0x1C68(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_410F3EEF46D0B9BE9EABAC80D7D64D6C;// 0x1CB0(0x00D8)
	bool                                               Deployed;                                                 // 0x1D88(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PrinterReady;                                             // 0x1D89(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Printing;                                                 // 0x1D8A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ButtonPress;                                              // 0x1D8B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PrintheadHeight;                                          // 0x1D8C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PrintheadExtension;                                       // 0x1D90(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PrintSpeed;                                               // 0x1D94(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     PrintHeadExtend;                                          // 0x1D98(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     PrintHeadHigh;                                            // 0x1DA4(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsButtonPressedTransitioning;                             // 0x1DB0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsPrinterStateTransitioning;                              // 0x1DB1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass BasePrinterT1_BP.BasePrinterT1_BP_C");
		return ptr;
	}


	void SetAnimationState(bool NewDeployed, bool NewPrinterReady, float NewPrintHeadExtension, float NewPrintHeadHeight, float NewPrintSpeed);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT1_BP_AnimGraphNode_TransitionResult_662FA4354F76FCC5D1E87483FB2063A5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT1_BP_AnimGraphNode_TransitionResult_0E625EA74D94C69D4B8D96A3229C34F6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT1_BP_AnimGraphNode_TransitionResult_E23574984000A82CFFA8B19F5901B437();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT1_BP_AnimGraphNode_TransitionResult_F18239EE4BF76EDFE50B9EA8A609B5B2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT1_BP_AnimGraphNode_TransitionResult_A2FBC90B449CA5CB76E1A0A08F2A6095();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT1_BP_AnimGraphNode_ModifyBone_5CF883BE47FDA55A41C438969559B0EA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT1_BP_AnimGraphNode_ModifyBone_AC690DF54B0ECBAC19C7BCA3EA62C401();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT1_BP_AnimGraphNode_SequencePlayer_E38DBF064EB1A2FD65A4599557DC66C8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT1_BP_AnimGraphNode_TransitionResult_15F94F37463A795BB712E1A444107C25();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT1_BP_AnimGraphNode_TransitionResult_1022C55340C2915409E9C8AA7DA8A8AB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT1_BP_AnimGraphNode_ModifyBone_D17746E5419B5E3AA03A52B0A139302E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT1_BP_AnimGraphNode_ModifyBone_9377111B4BA266F17E78BAAC87DC67F7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT1_BP_AnimGraphNode_TransitionResult_6A3183AC43D62A33855861901C1C9E23();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT1_BP_AnimGraphNode_ModifyBone_7AF9D2774F535456D18E24AB9509EAD6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT1_BP_AnimGraphNode_ModifyBone_B0B0B5214015194FE1A3DEB0B43FD3A3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT1_BP_AnimGraphNode_TransitionResult_6C3283B44FD55905B329FDAD55019391();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT1_BP_AnimGraphNode_TransitionResult_16FD0A6F45DE70DF2098949D0A8ADDFF();
	void AnimNotify_OnButtonPressedTransitionStarted();
	void AnimNotify_OnButtonPressedTransitionFinished();
	void AnimNotify_OnButtonReleasedTransitionFinished();
	void AnimNotify_OnPrinterStartTransition();
	void AnimNotify_OnPrinterUnpoweredTransitionFinished();
	void AnimNotify_OnPrinterOffTransitionFinished();
	void BlueprintBeginPlay();
	void ExecuteUbergraph_BasePrinterT1_BP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
