#pragma once

// Name: Astroneer-SDK, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BaseCondenserT3_AnimBP.BaseCondenserT3_AnimBP_C
// 0x16C4 (0x1A94 - 0x03D0)
class UBaseCondenserT3_AnimBP_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x03D0(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_51F2E1C7469298664B993183E8DA3136;      // 0x03D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_890645AD4857DB918190E39550E03A9D;// 0x0420(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B615520742143467F9C933B84C00F511;// 0x04A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_108EDEFE458AE50A699E9E9D0766214D;// 0x0520(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_71F5E6F8438FD221F826DA9C127D2CB2;// 0x05A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7281B249439E4F7816A976A1998A3893;// 0x0620(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0E1E5F5D4C33BE0DD2F73EB02A4A6141;// 0x06A0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F3A661EA42C30EAFF80A3B8FE94E0A94;// 0x0720(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F4B94D5C4427D48EC86B9CA532339603;// 0x0790(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F5F5B7C04CE7A8060AFBAE85324FFD22;// 0x07D8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F7D6E9014E824D3086B5E7AE5BC5E9BD;// 0x0848(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4F3E327343417BD144D2258FAFC7A837;// 0x0890(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D48EE6F24EDCB822845A01981F1D269D;// 0x0900(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_CFFAFF3540B86FA7EF56598294555681;// 0x0948(0x00D8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_34A4F5C04E723A995997399ED876D641;// 0x0A20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB5BDC834BC506659F2EA2B0A093E229;// 0x0AA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C28B41304ADA4EA7060124936E02C73F;// 0x0B20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4002E5A74C31920426F038BE8542B8AE;// 0x0BA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4E429BA44A69584ACD9135A071126579;// 0x0C20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2444E2E747AB899D087C90925664BEF6;// 0x0CA0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F4B4D5F44FBF5B3E58BE578144040903;// 0x0D20(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FEC1648D41B709A8711FF9A94B80866D;// 0x0D90(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B14915A5441374C8350B45BFED6CE232;// 0x0DD8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_962C59494B71710D74891E9F67A0EB33;// 0x0E48(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ADB993FF4E4D44773FBAE5AF31BFF9A6;// 0x0E90(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_29FB1CD04BEC65C920D75F8A60AF663F;// 0x0F00(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_824D9B074389EBFE881323BCFF6915A3;// 0x0F48(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ABC2EEEF496A16BE56EE43A96BAD5446;// 0x0FB8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6D6EE97D442BDF31ED6C0D8CF32D44EC;// 0x1000(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_09E4DBDB468E357C6CEF5FA4643C37C6;// 0x1070(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_44B7FADE4C3356EEB05EA8812F470203;// 0x10B8(0x00D8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D6B5914A4202B303424D1087880E3736;// 0x1190(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CAD2057E4D1530B1A699219D430E3D2B;// 0x1210(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_26738DBF4D87B7471450009975B65804;// 0x1290(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2F815A1347C955234F194DA213DADAC4;// 0x1310(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_854DB4074FF6FDBABC82C192F8C30621;// 0x1380(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_729A41F84AAEC04CDCB45C8F62D9C363;// 0x13C8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6794F0E04DF17EFF6DFC85A61E5AE8BE;// 0x1438(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_090C86224A543ACBAB854394449EAE65;// 0x1480(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9CC75F86439846B52EB69DAC4DAEEAC8;// 0x14F0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6EC50D1E45B21395516CEF869E5E256A;// 0x1538(0x00D8)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_84A1B55F4ED6944F83F5258A67912513;// 0x1610(0x0038)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_063336C64DDD4A2B52B828A6698DDD7D;// 0x1648(0x0038)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_01A82E2A4F6D36E21E28908368EA65C1;// 0x1680(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_AB0365E04A80366A927A8A8DBC6CA614;// 0x16B8(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_86F97FAF44C9BFC83262F195A2D31759;// 0x1730(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_245D80CE4D5F06D357D6FFB530573EA9;// 0x17A8(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_4345CDDC4CC9FF3692454C8AA7C9F410;// 0x1820(0x00E0)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_94A425104CF2A2A69E1BF99CA882CE63;// 0x1900(0x0038)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9393680649E4652907F720B5ABBC0EB1;// 0x1938(0x00B8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_97C2ED064D89DBBEFCF1E48A33199E72;// 0x19F0(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_B554541D433D2E08DF6FDDAF0FE9DADE;// 0x1A38(0x0048)
	bool                                               DialWiggleSmall;                                          // 0x1A80(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               DialWiggleLarge;                                          // 0x1A81(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FilterIsPlunging;                                         // 0x1A82(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FilterIsSpinning;                                         // 0x1A83(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               SpinnerIsOn;                                              // 0x1A84(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x1A85(0x0003) MISSED OFFSET
	float                                              FilterPlungerSpeed;                                       // 0x1A88(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PowerDegree;                                              // 0x1A8C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DialDegree;                                               // 0x1A90(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass BaseCondenserT3_AnimBP.BaseCondenserT3_AnimBP_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_BaseCondenserT3_AnimBP_AnimGraphNode_TransitionResult_0E1E5F5D4C33BE0DD2F73EB02A4A6141();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BaseCondenserT3_AnimBP_AnimGraphNode_TransitionResult_C28B41304ADA4EA7060124936E02C73F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BaseCondenserT3_AnimBP_AnimGraphNode_TransitionResult_4002E5A74C31920426F038BE8542B8AE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BaseCondenserT3_AnimBP_AnimGraphNode_TransitionResult_7281B249439E4F7816A976A1998A3893();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BaseCondenserT3_AnimBP_AnimGraphNode_TransitionResult_2444E2E747AB899D087C90925664BEF6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BaseCondenserT3_AnimBP_AnimGraphNode_SequencePlayer_F4B4D5F44FBF5B3E58BE578144040903();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BaseCondenserT3_AnimBP_AnimGraphNode_SequencePlayer_ADB993FF4E4D44773FBAE5AF31BFF9A6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BaseCondenserT3_AnimBP_AnimGraphNode_TransitionResult_71F5E6F8438FD221F826DA9C127D2CB2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BaseCondenserT3_AnimBP_AnimGraphNode_TransitionResult_108EDEFE458AE50A699E9E9D0766214D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BaseCondenserT3_AnimBP_AnimGraphNode_TransitionResult_CAD2057E4D1530B1A699219D430E3D2B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BaseCondenserT3_AnimBP_AnimGraphNode_TransitionResult_26738DBF4D87B7471450009975B65804();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BaseCondenserT3_AnimBP_AnimGraphNode_SequencePlayer_2F815A1347C955234F194DA213DADAC4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BaseCondenserT3_AnimBP_AnimGraphNode_SequencePlayer_729A41F84AAEC04CDCB45C8F62D9C363();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BaseCondenserT3_AnimBP_AnimGraphNode_TransitionResult_B615520742143467F9C933B84C00F511();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BaseCondenserT3_AnimBP_AnimGraphNode_ModifyBone_9393680649E4652907F720B5ABBC0EB1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BaseCondenserT3_AnimBP_AnimGraphNode_TransitionResult_890645AD4857DB918190E39550E03A9D();
	void ExecuteUbergraph_BaseCondenserT3_AnimBP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
