#pragma once

// Name: Astroneer-SDK, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BasePrinterT2_AnimBP.BasePrinterT2_AnimBP_C
// 0x19DA (0x1DAA - 0x03D0)
class UBasePrinterT2_AnimBP_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x03D0(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_30ED60484B0C29D59F0AC384262952E1;      // 0x03D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_20225CD9423BC3987153E1BC647A3807;// 0x0420(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_030DD63B4F695EDE80D18BA8B48377C9;// 0x04A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5712734D42C40F20D5F07B937BFCAE5A;// 0x0520(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6E70395747E4EB918892D198F2A92A42;// 0x05A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F2B02BE84190DF037EDE6CA591823365;// 0x0620(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32B822294F2EC3FC15D67699738EF6FE;// 0x06A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6D923B0D441B06D81A1916802648597E;// 0x0720(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D5F8EFEC4E2334CE86559881BD00682B;// 0x07A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_48EC47EC4AE4CFD8EFAECEB2A87874A1;// 0x0820(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A6CCB3F444BED747E18272B4D2854306;// 0x08A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F47918F7446487536894CBAD2CDE918A;// 0x0920(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2E2C5B1745D27D366FDCADAFB996B7272;// 0x09A0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_867543A44B2307B494B166B18E12CA872;// 0x0A10(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_40A45882478622B4503BBFBB93AC8167;// 0x0A58(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7AB7DA9440BBBA9B840C3CA8AC9417A3;// 0x0AC8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7B9048E44C38E49B3F228E816CC2C7F2;// 0x0B10(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_CC96DE1D4C2B32BA473AF6BFAA2F17E8;// 0x0B58(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DA95F11F4F3F4D19DAF5F58819A5AD7D;// 0x0BA0(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B816034643FE295E5B56C894533D2634;// 0x0C58(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2FE381A947E33F7AD7F80BB59A5419DB;// 0x0D10(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6D42072B440D55E2D64CBBA439206A31;// 0x0D80(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_52EFF87A4D7C4DEA643EE58EA4CA6281;// 0x0DC8(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_DE2D5B30422DFBA91A4A51965E3C7276;// 0x0E10(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_BD744F474E913FC9ECB3A099E03715E6;// 0x0E58(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3574E2F9473C85CA6E57A884D044A321;// 0x0F10(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FEAC1908401D7F4578C04A99F41E5DE7;// 0x0FC8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7B9376B941DCEADE9D6CAAB88DFB6709;// 0x1038(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_FA10BEE14C39AE9BF5D5F49C3C7084F2;// 0x1080(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_B5637751448FB8ED973A6AA8F8E5900A;// 0x10C8(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9B6FB13A490EEED041077C9C6A88F3C1;// 0x1110(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9E3BD040403C15A9C8EA72B403A021C0;// 0x11C8(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_838145244A239848FB38A09A9654B72C;// 0x1280(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_479DDF534318F8B1C35C9CACF03F5D0D;// 0x12F0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_52B77ED7457A195B3BB4ACB41E9B3F3A;// 0x1338(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3D9C78E645F12358FF931EAA420CF3B9;// 0x13A8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CC30EE524499773BB67CF582A2CBE49D;// 0x13F0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AD14AA2544F3DF62FF33A885F99CC880;// 0x1460(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2E2C5B1745D27D366FDCADAFB996B727;// 0x14A8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_867543A44B2307B494B166B18E12CA87;// 0x1518(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C22541E84C9BDAA0691F3FAB1D907D09;// 0x1560(0x00D8)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_D85F2EFF470A0043EEBC82B6E53006DB;// 0x1638(0x0038)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_63943DAA4686FE0754A04CBDA6DA75B1;// 0x1670(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_187AF243406DD03087308F9B9E8C5403;// 0x16F0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88FFD1DB42FE79C11054958476CCBBBD;// 0x1770(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B3AD3614AF0B1EF626658A970B9EDB0;// 0x17F0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6E7F01854A099751EDFC51825FFBBD432;// 0x1870(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8906E55743871E883B857ABF28E529072;// 0x18E0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A32DCD98407FAADC072FF08860A652EC2;// 0x1928(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C341AD874D7D59CECF0F1DBA44A999492;// 0x1998(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6E7F01854A099751EDFC51825FFBBD43;// 0x19E0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8906E55743871E883B857ABF28E52907;// 0x1A50(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A32DCD98407FAADC072FF08860A652EC;// 0x1A98(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C341AD874D7D59CECF0F1DBA44A99949;// 0x1B08(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_F4CF9A2648A928516507979C3C45A811;// 0x1B50(0x00D8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_441F29654B2F7F877A47F0A65BA8AC8F;// 0x1C28(0x00E0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_2B1A148C40560A7904BD2ABF2CECE1D0;// 0x1D08(0x0078)
	bool                                               Deployed;                                                 // 0x1D80(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PrinterReady;                                             // 0x1D81(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Printing;                                                 // 0x1D82(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ButtonPress;                                              // 0x1D83(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PrintheadHeight;                                          // 0x1D84(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PrintheadExtension;                                       // 0x1D88(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PrintSpeed;                                               // 0x1D8C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     PrintHeadExtend;                                          // 0x1D90(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     PrintHeadHigh;                                            // 0x1D9C(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsButtonPressedTransitioning;                             // 0x1DA8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsPrinterStateTransitioning;                              // 0x1DA9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass BasePrinterT2_AnimBP.BasePrinterT2_AnimBP_C");
		return ptr;
	}


	void SetAnimationState(bool NewDeployed, bool NewPrinterReady, float NewPrintHeadExtension, float NewPrintHeadHeight, float NewPrintSpeed);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT2_AnimBP_AnimGraphNode_ModifyBone_B816034643FE295E5B56C894533D2634();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT2_AnimBP_AnimGraphNode_ModifyBone_DA95F11F4F3F4D19DAF5F58819A5AD7D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT2_AnimBP_AnimGraphNode_TransitionResult_48EC47EC4AE4CFD8EFAECEB2A87874A1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT2_AnimBP_AnimGraphNode_ModifyBone_BD744F474E913FC9ECB3A099E03715E6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT2_AnimBP_AnimGraphNode_ModifyBone_3574E2F9473C85CA6E57A884D044A321();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT2_AnimBP_AnimGraphNode_SequencePlayer_FEAC1908401D7F4578C04A99F41E5DE7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT2_AnimBP_AnimGraphNode_TransitionResult_D5F8EFEC4E2334CE86559881BD00682B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT2_AnimBP_AnimGraphNode_ModifyBone_9B6FB13A490EEED041077C9C6A88F3C1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT2_AnimBP_AnimGraphNode_ModifyBone_9E3BD040403C15A9C8EA72B403A021C0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT2_AnimBP_AnimGraphNode_TransitionResult_6D923B0D441B06D81A1916802648597E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT2_AnimBP_AnimGraphNode_TransitionResult_32B822294F2EC3FC15D67699738EF6FE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT2_AnimBP_AnimGraphNode_TransitionResult_F2B02BE84190DF037EDE6CA591823365();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT2_AnimBP_AnimGraphNode_TransitionResult_63943DAA4686FE0754A04CBDA6DA75B1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT2_AnimBP_AnimGraphNode_TransitionResult_6E70395747E4EB918892D198F2A92A42();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT2_AnimBP_AnimGraphNode_TransitionResult_8B3AD3614AF0B1EF626658A970B9EDB0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT2_AnimBP_AnimGraphNode_TransitionResult_5712734D42C40F20D5F07B937BFCAE5A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BasePrinterT2_AnimBP_AnimGraphNode_TransitionResult_F47918F7446487536894CBAD2CDE918A();
	void AnimNotify_OnButtonPressedTransitionStarted();
	void AnimNotify_OnButtonPressedTransitionFinished();
	void AnimNotify_OnButtonReleasedTransitionFinished();
	void AnimNotify_OnPrinterStartTransition();
	void AnimNotify_OnPrinterUnpoweredTransitionFinished();
	void AnimNotify_OnPrinterOffTransitionFinished();
	void BlueprintBeginPlay();
	void ExecuteUbergraph_BasePrinterT2_AnimBP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
