#pragma once

// Name: Astroneer-SDK, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ControlPanelSpliltter_AnimBP.ControlPanelSpliltter_AnimBP_C
// 0x1B24 (0x1EF4 - 0x03D0)
class UControlPanelSpliltter_AnimBP_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x03D0(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_E781802A4DF388995C63DB9A7CE6EF36;      // 0x03D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7A10360345FFED85B515DE9758451B203;// 0x0420(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B80306A4B6DF3230AF809B891DF09583;// 0x04A0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_509912D94F8E494EEC870FA3341930C8;// 0x0520(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_99DF2CF14EF41B26981D9C8E6B4984A83;// 0x0590(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_22C267474490F90C190481A956E67F86;// 0x05D8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2BF607CE48852E4B11091CB13FDFE6363;// 0x0648(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_86F7B0DA4A259C0113DC23A468181B18;// 0x0690(0x00D8)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0768(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7A10360345FFED85B515DE9758451B202;// 0x0770(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B80306A4B6DF3230AF809B891DF09582;// 0x07F0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4D67755144AE6385CB65B69C3C252896;// 0x0870(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_99DF2CF14EF41B26981D9C8E6B4984A82;// 0x08E0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5FA2A54D406E321CDB0CB1A65D557DF9;// 0x0928(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2BF607CE48852E4B11091CB13FDFE6362;// 0x0998(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_0C1BDCB94350D0E18FEE0C944F4B6439;// 0x09E0(0x00D8)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0AB8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7A10360345FFED85B515DE9758451B20;// 0x0AC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B80306A4B6DF3230AF809B891DF0958;// 0x0B40(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8B0FD58848C6FA6FA57FAB93E267C1B4;// 0x0BC0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_99DF2CF14EF41B26981D9C8E6B4984A8;// 0x0C30(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B5E37EC14B1068C49068F394D1D3A01B;// 0x0C78(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2BF607CE48852E4B11091CB13FDFE636;// 0x0CE8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FD4B6D70473225F3E0289C819C69624C;// 0x0D30(0x00D8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_85198DD74D938790BA8995AD2EE6B9F5;// 0x0E08(0x00E0)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_CF1F906B44E0531A22EF928B7A4DE89D;// 0x0EE8(0x0038)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DA3BB88B4F447B2F5702A5B2AFAC09FB;// 0x0F20(0x00B8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_14E6557140D0CF2882C89080B782454D;// 0x0FD8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_234BF685418F38F6E883E389075787D8;// 0x1020(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3D46C7CE402C0AA225BD829C9D069D5D;// 0x1068(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CC78B9A945009BEA044DE689E8E14B16;// 0x1120(0x00B8)
	unsigned char                                      UnknownData02[0x8];                                       // 0x11D8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_893766014AD126EF34B1638638EBA5F02;// 0x11E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5969C1C64C2E173B85EFEEA2880611182;// 0x1260(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BEC1E24D4BE2BB9E6EA26DAE767480B0;// 0x12E0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E8C158A94925D43BD5CC91AF9D403AA52;// 0x1350(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0AD677F243D2BCCD3ADF56A7032574EA;// 0x1398(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2450E87F420A420AD2FB018A9BE1494F2;// 0x1408(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_EC722C5542AC3BFF81CCF4806F67F4AD;// 0x1450(0x00D8)
	unsigned char                                      UnknownData03[0x8];                                       // 0x1528(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_893766014AD126EF34B1638638EBA5F0;// 0x1530(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5969C1C64C2E173B85EFEEA288061118;// 0x15B0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6387051841EBEA9B4674C89FA90DC115;// 0x1630(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E8C158A94925D43BD5CC91AF9D403AA5;// 0x16A0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EFD287AD41C50DEF848D92B6AA0D87D3;// 0x16E8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2450E87F420A420AD2FB018A9BE1494F;// 0x1758(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3A96F2B241E6EDA9AA42D69FE80637FD;// 0x17A0(0x00D8)
	unsigned char                                      UnknownData04[0x8];                                       // 0x1878(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4FEC2FCB488087EB0C5ED0815773EE7D;// 0x1880(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B254970048C3D7972F537AAA389DDD8D;// 0x1900(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C2CA22F34AE3193CBCCD29AB1784CBD5;// 0x1980(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_352A6A7B40FFD7F9B66FA89A00318332;// 0x19F0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9129005243A9928EBBEB9D843E5ADCB7;// 0x1A38(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_077402CD4FC620E37EED5A9806BF6724;// 0x1AA8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_F3A0780746CD08ECC1E10F82F4134F83;// 0x1AF0(0x00D8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_B2A84BE349E152D0A59538BF57E1BACD;// 0x1BC8(0x00E0)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_70D0752E41B174DD2BA549895B255CF7;// 0x1CA8(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_31A35CE441EFE835A6BA4A83364AD327;// 0x1CE0(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_3C6A87474EF4442AA5C6209D20D9CDEB;// 0x1D58(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_E0D6B58C479374DD5395E2AC2DE4E73F;// 0x1DD0(0x0078)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_D28533824314633D5E72B19FDE8ED9CF;// 0x1E48(0x0038)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_B5A59CA148272FDCBD44B4B78FA50FA2;// 0x1E80(0x0038)
	bool                                               Cable1Active;                                             // 0x1EB8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Cable2Active;                                             // 0x1EB9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Cable3Active;                                             // 0x1EBA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x1];                                       // 0x1EBB(0x0001) MISSED OFFSET
	float                                              SliderTravelDistance;                                     // 0x1EBC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Slider1Position;                                          // 0x1EC0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Slider2Position;                                          // 0x1EC4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Slider3Position;                                          // 0x1EC8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Handle1Active;                                            // 0x1ECC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Handle2Active;                                            // 0x1ECD(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Handle3Active;                                            // 0x1ECE(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x1];                                       // 0x1ECF(0x0001) MISSED OFFSET
	struct FVector                                     Slider1PositionAndTravelDistance;                         // 0x1ED0(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     Slider2PositionAndTravelDistance;                         // 0x1EDC(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     Slider3PositionAndTravelDistance;                         // 0x1EE8(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass ControlPanelSpliltter_AnimBP.ControlPanelSpliltter_AnimBP_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelSpliltter_AnimBP_AnimGraphNode_TransitionResult_8B80306A4B6DF3230AF809B891DF0958();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelSpliltter_AnimBP_AnimGraphNode_ModifyBone_DA3BB88B4F447B2F5702A5B2AFAC09FB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelSpliltter_AnimBP_AnimGraphNode_ModifyBone_3D46C7CE402C0AA225BD829C9D069D5D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelSpliltter_AnimBP_AnimGraphNode_ModifyBone_CC78B9A945009BEA044DE689E8E14B16();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelSpliltter_AnimBP_AnimGraphNode_TransitionResult_893766014AD126EF34B1638638EBA5F0_1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelSpliltter_AnimBP_AnimGraphNode_TransitionResult_5969C1C64C2E173B85EFEEA288061118_1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelSpliltter_AnimBP_AnimGraphNode_TransitionResult_7A10360345FFED85B515DE9758451B20();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelSpliltter_AnimBP_AnimGraphNode_TransitionResult_893766014AD126EF34B1638638EBA5F0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelSpliltter_AnimBP_AnimGraphNode_TransitionResult_5969C1C64C2E173B85EFEEA288061118();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelSpliltter_AnimBP_AnimGraphNode_TransitionResult_8B80306A4B6DF3230AF809B891DF0958_1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelSpliltter_AnimBP_AnimGraphNode_TransitionResult_4FEC2FCB488087EB0C5ED0815773EE7D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelSpliltter_AnimBP_AnimGraphNode_TransitionResult_B254970048C3D7972F537AAA389DDD8D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelSpliltter_AnimBP_AnimGraphNode_TransitionResult_7A10360345FFED85B515DE9758451B20_1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelSpliltter_AnimBP_AnimGraphNode_TransitionResult_8B80306A4B6DF3230AF809B891DF0958_2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelSpliltter_AnimBP_AnimGraphNode_TransitionResult_7A10360345FFED85B515DE9758451B20_2();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ControlPanelSpliltter_AnimBP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
