#pragma once

// Name: Astroneer-SDK, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ControlPanelPrinter_AnimBP.ControlPanelPrinter_AnimBP_C
// 0x1F3F (0x230F - 0x03D0)
class UControlPanelPrinter_AnimBP_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x03D0(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_DE1B4D2F4A4416953616CAB064E2E39F;      // 0x03D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4B0AB36C49EEE2D214172EADEFE27AB9;// 0x0420(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_87AA352F490E16B858D67A9B0C0DD253;// 0x04A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_623C2172450385E9A287A78417DA4B8A;// 0x0520(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3A517C804CA321B13C3BB6B4C64AC072;// 0x05A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7D4B717A488793B921AC58908634AE09;// 0x0620(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8830B79C4A538D8FCAB72E96E9BB957C;// 0x06A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9A2FDE144002AEB9C31273A0B524B773;// 0x0720(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F1D376B40442DC9490F0B938753056A;// 0x07A0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2A56B4EB453141DF9A0345BE1DBBB130;// 0x0820(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_42774C8847A85BE94B938495288D42EF;// 0x0890(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_776A0FC0453A1B52F03356B1F3363552;// 0x08D8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B927D9BE446809B086E6F3B80D5A7968;// 0x0948(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C1D4BFC043F5AB422A7A8DB1F43457F0;// 0x0990(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CB16DA594CFC2866A14002A23DDE5214;// 0x0A00(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_26E3D2A547D86EEFC7793B96446C0E58;// 0x0A48(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6652B62C43BDBEB8B6C3CCA5480073E6;// 0x0AB8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F2A71D054F20B5A08ADD0791E51E9B49;// 0x0B00(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0086D1014C772F86E7B57AADCA7E326D;// 0x0B70(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7D3D0E5E418CADF5EC40319B5AB1A172;// 0x0BB8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_19C520874E1D7CCC5AA308BB8EE56257;// 0x0C28(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9B36053B4F15B9309F3EA9B5C4461D86;// 0x0C70(0x00D8)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_AED00217463FEEBC4CF9A1BD9503B413;// 0x0D48(0x0038)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_7CB01A3D4F74D95C68D9A7BE5BA84915;// 0x0D80(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_AD1852E540DD18BC98C147B203EA5308;// 0x0DB8(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_7594679047BF920B6250D19716C705C8;// 0x0E30(0x00E0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C4DF0C884880C316C90446894FD8DC53;// 0x0F10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CE149DEC40D71055EC4E71AFE149526D;// 0x0F90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6DF852284DB712D933B624913F600534;// 0x1010(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_55CADA634E04C07CACFD52B557498337;// 0x1090(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_397701B9494F823055AA40980F164DD4;// 0x1110(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8078D7E7464C159EE43D26A3405FC336;// 0x1190(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5B1822314AC11757C5BF3D90A335B607;// 0x1200(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E62E323E45A77ACCC0E3C9A4B1F0E69A;// 0x1248(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9D4AE10E41D40780EF059884F762100F;// 0x12B8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7800FDC243EED910D0586D82C4E081A2;// 0x1300(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D8E7885949983B28428EE18FD89CBF2B;// 0x1370(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5FF569934EA4C78C5EB73782C2DEDC77;// 0x13B8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8B2DB464499F88B26BEFB4935680E41D;// 0x1428(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1B17A7304EFE4ADCE557D7B940FC8116;// 0x1470(0x00D8)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_D9EB3A90481AF08685AB71A8984E90AD;// 0x1548(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_A3C6D8BC43C96C903C8A4E86AACDD080;// 0x1580(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_8B2ADD03444D1206161BFBB186F31ACD;// 0x15F8(0x00E0)
	unsigned char                                      UnknownData00[0x8];                                       // 0x16D8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_40B325D044380CB5B302E9BB6CA7FA2B;// 0x16E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E6C72BD24BA603C13E243DAC817F1F8B;// 0x1760(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_58A0C10D43560918F3DF4B88F5AB42A8;// 0x17E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_540BFE80454A9AE75F824FAFE3E9A996;// 0x1860(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DE69AB8A4EC473F457FDDDBFB7DD7ABF;// 0x18E0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3867DDD3449AEC807DE3658F6F827AAE;// 0x1960(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_328234B845171D5E611D2E93022BB1DF;// 0x19D0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AD3997444C3F5A838AFDDF9DD3F6B1B7;// 0x1A18(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8DAFA8F74048E80AABF0C9812404B381;// 0x1A88(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_662CA3B44669E7E88D409DB86D26DFCC;// 0x1AD0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0D7FE79545FC97EA85E5A6A768FF367C;// 0x1B40(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A02A4DD9499BD4267156959DCF090F26;// 0x1B88(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1483B8824BF37BD12671E6A30A579F06;// 0x1BF8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_8BDA48A04FBEB24FDE4C56B16CE68330;// 0x1C40(0x00D8)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_86E0621F47DCF95907F13CA61D6D0566;// 0x1D18(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_BB761F4F49C544392C6D79816049C942;// 0x1D50(0x0078)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_5F113AC643F5B869EDE4E9ABCEB0FE1F;      // 0x1DC8(0x0068)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_2531C8D7407D74A158354E8311798D07;// 0x1E30(0x0038)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_306422274BBAB545137C8EB136A2163D;// 0x1E68(0x00E0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_F72F2AA74D4AABA44CFEEB9A62976535;// 0x1F48(0x0078)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9ECF81B141705884AD7FC5815DEDFF5E;// 0x1FC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8E9BDAE949181EF9116E1C8FD26DE157;// 0x2040(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_067551724CC8732A948513998D7341AB;// 0x20C0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4FCC03AA421773E3B71627A07382BD1C;// 0x2130(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_03959F6444800FCC82B0548D945CC98C;// 0x2178(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BE5D31FB40F0C1E2AFE65F9B090BF7AA;// 0x21E8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1540EA294CC747E8895CCBBEEF9201A7;// 0x2230(0x00D8)
	bool                                               CoverOpen;                                                // 0x2308(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ButtonLeftPress;                                          // 0x2309(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               CoverHover;                                               // 0x230A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ButtonLeftHover;                                          // 0x230B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ButtonRightPress;                                         // 0x230C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ButtonRightHover;                                         // 0x230D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ButtonBigHover;                                           // 0x230E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass ControlPanelPrinter_AnimBP.ControlPanelPrinter_AnimBP_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelPrinter_AnimBP_AnimGraphNode_TransitionResult_6DF852284DB712D933B624913F600534();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelPrinter_AnimBP_AnimGraphNode_TransitionResult_55CADA634E04C07CACFD52B557498337();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelPrinter_AnimBP_AnimGraphNode_TransitionResult_CE149DEC40D71055EC4E71AFE149526D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelPrinter_AnimBP_AnimGraphNode_TransitionResult_C4DF0C884880C316C90446894FD8DC53();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelPrinter_AnimBP_AnimGraphNode_TransitionResult_40B325D044380CB5B302E9BB6CA7FA2B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelPrinter_AnimBP_AnimGraphNode_TransitionResult_E6C72BD24BA603C13E243DAC817F1F8B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelPrinter_AnimBP_AnimGraphNode_TransitionResult_8830B79C4A538D8FCAB72E96E9BB957C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelPrinter_AnimBP_AnimGraphNode_TransitionResult_58A0C10D43560918F3DF4B88F5AB42A8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelPrinter_AnimBP_AnimGraphNode_TransitionResult_540BFE80454A9AE75F824FAFE3E9A996();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelPrinter_AnimBP_AnimGraphNode_TransitionResult_7D4B717A488793B921AC58908634AE09();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelPrinter_AnimBP_AnimGraphNode_TransitionResult_3A517C804CA321B13C3BB6B4C64AC072();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelPrinter_AnimBP_AnimGraphNode_TransitionResult_9ECF81B141705884AD7FC5815DEDFF5E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelPrinter_AnimBP_AnimGraphNode_TransitionResult_8E9BDAE949181EF9116E1C8FD26DE157();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelPrinter_AnimBP_AnimGraphNode_TransitionResult_623C2172450385E9A287A78417DA4B8A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelPrinter_AnimBP_AnimGraphNode_TransitionResult_87AA352F490E16B858D67A9B0C0DD253();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ControlPanelPrinter_AnimBP_AnimGraphNode_TransitionResult_4B0AB36C49EEE2D214172EADEFE27AB9();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ControlPanelPrinter_AnimBP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
