#pragma once

// Name: Astroneer-SDK, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass CorpseBackpack_AnimBP.CorpseBackpack_AnimBP_C
// 0x132D (0x16FD - 0x03D0)
class UCorpseBackpack_AnimBP_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x03D0(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_2212502A4A50851F11FCF9AF9CDF7589;      // 0x03D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4560173449EA78258ABF33B0FABA80DD;// 0x0420(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E987199D4246F3F796BF329327BEA2DF;// 0x04A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_29C61792417AE94DF7CDF09074446989;// 0x0520(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D41F2A3C43E7D55334C1A5A03E59F659;// 0x05A0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7930191F433A2B65600BB0B241F0F829;// 0x0620(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F173C26F42D6C3737DCF8D99F488CECA;// 0x0690(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8664B2914C66AE42E350CBA673C5A14C;// 0x06D8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BD2F47DA4308DE9C4C45F2BD262B04C4;// 0x0748(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E2C66E55405E1B84D750059B05F78699;// 0x0790(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5C6AD80F4A46659BF5F4949CA0360762;// 0x0800(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7494445941E67238CD97E1BA37648D22;// 0x0848(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D5E3B50D4AFFA5F363EE019579B477C9;// 0x08B8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_21CE6F3D4F3F0D9F04A2AF8D09FB3D77;// 0x0900(0x00D8)
	unsigned char                                      UnknownData00[0x8];                                       // 0x09D8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_27A6DA3B49075A3B42A71BA69CD4E88F;// 0x09E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4A875649428D5A39C3E378987AD18932;// 0x0A60(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FC4CEF3F48E7455E322A9F969BED69D2;// 0x0AE0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_62C2A4534DC468D20F4E34B72D4805EA;// 0x0B60(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1BAA3B7241D53A70EE9B67B2FFFEE46A;// 0x0BE0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_95C015344C1127CBAD5A779920CA9649;// 0x0C50(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D19F366B46E3E54F13B230B24A3902B8;// 0x0C98(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2CCEDFFA43BF42AEE046C19B631A2B89;// 0x0D08(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A8D297F94E618BC1A6B591A06A95CEEF;// 0x0D50(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F06E325744FB493FCAF870B4AEF2B4EF;// 0x0DC0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_88E759FD4AD982D7A9C5B1A0AFCC48B0;// 0x0E08(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C1663EE04260AC99F704EAA3D95F8A95;// 0x0E78(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_0DA35CEF4144D281F1B03DA7268AC22A;// 0x0EC0(0x00D8)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_A1C87B744F05D7E10F73D7AD60725DA7;// 0x0F98(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_DB10DED54DC8F20181E0C0BE794E9913;// 0x0FD0(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_4D1FFE7445ABB94774921E914EED4E2C;// 0x1048(0x0078)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F8C18DCF4558473A1FB027AE32648001;// 0x10C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B0B50374477959F1F15DD6A72846E030;// 0x1140(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D5B7291A49ABD706B4D171909CF40321;// 0x11C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A8A0060F4A06299C84B000BD9B051BE4;// 0x1240(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_30A102AD43CF60BC68733EB79100AC02;// 0x12C0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EECFC6C543C42E893326F583D5087F0C;// 0x1330(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A9900C784BB29C28952A759A432F52CA;// 0x1378(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_722BF0954762814A86C751A43BD8E76E;// 0x13E8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_14CD504D4F5BA0B9B5FAE09ED0516B9F;// 0x1430(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AA9D3BF14DFB5D1EF95CB5A9F2714242;// 0x14A0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BCFD2D1C4CAF9CE6BDD4C5B4C68E5635;// 0x14E8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_14E4D003477B62B45AC6D2BE587CB43E;// 0x1558(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FEA2D6954879E96F2909A187409F9B05;// 0x15A0(0x00D8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_6E7059D3442C802C3E50B983678E5716;// 0x1678(0x0078)
	bool                                               LeftAuxSlotted;                                           // 0x16F0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               RightAuxSlotted;                                          // 0x16F1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x16F2(0x0002) MISSED OFFSET
	float                                              accum;                                                    // 0x16F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               GotFirstTick;                                             // 0x16F8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PrinterActive;                                            // 0x16F9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsPrinterInTransition;                                    // 0x16FA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsLeftAuxInTransition;                                    // 0x16FB(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsRightAuxInTransition;                                   // 0x16FC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass CorpseBackpack_AnimBP.CorpseBackpack_AnimBP_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_CorpseBackpack_AnimBP_AnimGraphNode_TransitionResult_27A6DA3B49075A3B42A71BA69CD4E88F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CorpseBackpack_AnimBP_AnimGraphNode_TransitionResult_62C2A4534DC468D20F4E34B72D4805EA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CorpseBackpack_AnimBP_AnimGraphNode_TransitionResult_F8C18DCF4558473A1FB027AE32648001();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CorpseBackpack_AnimBP_AnimGraphNode_TransitionResult_D41F2A3C43E7D55334C1A5A03E59F659();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CorpseBackpack_AnimBP_AnimGraphNode_TransitionResult_D5B7291A49ABD706B4D171909CF40321();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CorpseBackpack_AnimBP_AnimGraphNode_TransitionResult_4560173449EA78258ABF33B0FABA80DD();
	void OnSetItemLeft(class APhysicalItem* Item);
	void OnCrack();
	void OnClose();
	void OnReleaseItemLeft(class APhysicalItem* Item);
	void OnSetItemRight(class APhysicalItem* Item);
	void OnReleaseItemRight(class APhysicalItem* Item);
	void BlueprintBeginPlay();
	void AnimNotify_OnPrinterClosed();
	void AnimNotify_OnLeftAuxDown();
	void AnimNotify_OnLeftAuxUp();
	void AnimNotify_OnPrinterOpened();
	void AnimNotify_OnRightAuxDown();
	void AnimNotify_OnRightAuxUp();
	void AnimNotify_OnLeftAuxStartTransition();
	void AnimNotify_OnRightAuxStartTransition();
	void AnimNotify_OnPrinterStartTransition();
	void ExecuteUbergraph_CorpseBackpack_AnimBP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
