#pragma once

// Name: Astroneer-SDK, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass GateStation_AnimBP.GateStation_AnimBP_C
// 0x6900 (0x6CD0 - 0x03D0)
class UGateStation_AnimBP_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x03D0(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_BC3F3AFE4E3A389B6318AEA62CFE1A42;      // 0x03D8(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_04AD0F6E4926D2BB7EEAFFB5748EFA7C;// 0x0420(0x0038)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0458(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3380623A4E55650C36FE478F59FE75E37;// 0x0460(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5FF4BBE340E6A4FB4CBC1688603F29E27;// 0x04E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0B35EB4C4BECA0F43A3876B7A4CF9F9A7;// 0x0560(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4BBDDE5E4D21BFE673AA4E8EC58E8C4B7;// 0x05E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_344A90C94C0B0542A652809B787F26567;// 0x0660(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_90AF36E047D94C471934F4ACE359EBFA7;// 0x06E0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6198EFBF4320DA3221114E8AE2DD5C8C7;// 0x0750(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_73FECFE04339576AC17D90AFA95EC6187;// 0x0798(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7FBA0B5948FA3888292AD18863C5E8FD7;// 0x0808(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7065A7BB47C8164A12A91B874DF7C631;// 0x0850(0x0070)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_D7571731414892260560718E831BA11B;// 0x08C0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7023FE3C450460FA084AABA330B2BFB87;// 0x09A0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2870FF664E27EE2072F16998D3AF8A6F7;// 0x0A10(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3CAF326441CDB973CD95AAAD976708117;// 0x0A58(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9F6C0F03495498D5A359D39A902EC8357;// 0x0AC8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_E89000E34DC13B675EB70887D273B480;// 0x0B10(0x00D8)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_D7116A3640A060CB112A98A6F1BDBB23;// 0x0BE8(0x0038)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_122FC700476EDA0075708DBF7F05D957;// 0x0C20(0x0038)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_9EAC383746CEEE4452F5839BD4872C2E;// 0x0C58(0x0038)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_055CDFB247E41F509587A0A849D60602;// 0x0C90(0x0038)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_CC7F8CF841420797E2A73EBDAD18B72A;// 0x0CC8(0x0038)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_821DC7B346872D1114AEF8A00CC82DCA;// 0x0D00(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1E25CC254B67B1E9AE8B538B89A9DD53;// 0x0D38(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_35CBCC9349886718115B93A05519094D;// 0x0DB0(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_E5493C3D4CBD18F502AFE5A0CAABD17D;// 0x0E28(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_9A3A12AA4BFBB6FF86BF97B3DC1CA276;// 0x0EA0(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1A399C4040FF91B4B839C6BDEC1A5E5F;// 0x0F18(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_62C180B849317962080E259A63DE1052;// 0x0F90(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_ADFCCF344E7BF7D3D504B3AE89C19113;// 0x1008(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_82DFF159424247D4E26A189E2C55F364;// 0x1080(0x00E0)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_6940B6AD4FA6523F4C4AF09487AB2AFE;// 0x1160(0x0038)
	unsigned char                                      UnknownData01[0x8];                                       // 0x1198(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5429813B4204E2AC168D0A987DD03AF1;// 0x11A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1AE5C37F4DC1C2ABE387339C6101EA53;// 0x1220(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB915E3B4B7F5FEE6912259EB31581D9;// 0x12A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FC78A8654AB83116147B8C97CACE6E80;// 0x1320(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_317741804B816D1638524C9427B3D482;// 0x13A0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3842ECEE48E8A278D5BDF8B1E00DCFE1;// 0x1410(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8F0104E94C9CE1AD2D681F9FE279767E;// 0x1458(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2368C19F462C7ED924F6EB9DD1EE50FB;// 0x14C8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AB8D820F4369068CB5FCB982DB97C386;// 0x1510(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ECD772B74BC0C0A48BFDBAAF1382D420;// 0x1580(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_44FB01154420330ACAFEBDBC44A2C4F8;// 0x15C8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C5CA4C504C7C9386C8516797173674AE;// 0x1638(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6C4AE56E48C53478951DD7BB4F6DD5DF;// 0x1680(0x00D8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_701EEA0949B629CE6E41E1974F56B55F;// 0x1758(0x0078)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_DB3018E34A0DE448F62E918E6A8DC995;// 0x17D0(0x0038)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_399BDEB54863A21AA68C64A098FB2783;// 0x1808(0x00E0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_F79F4FB049EDD3D382C7FC952C55D502;      // 0x18E8(0x0068)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3261A6BF47E010416874D4807FD779AC7;// 0x1950(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE68FD1849057912AEA27BBC7D0F74687;// 0x19D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_571BD635448373FD9129E7841A35A4127;// 0x1A50(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D9F831C94A1B9834F0A6F9B29BB348267;// 0x1AD0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9839D7D744BCBD7C571A71B855BC00E67;// 0x1B50(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CBC5A51640CB56A5682D5A97A322E6F17;// 0x1BC0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E194820E4C5D003931F537AE81A78EBA7;// 0x1C08(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_003B5F6544E3DD14CB5A2BB4156D60E57;// 0x1C78(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F1FE54B8459BA78AA61668BFBC86A3617;// 0x1CC0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_39C3F97F4B2A391DA8D9CCB5C2459E187;// 0x1D30(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6D52F616479BB3BEDD6570AEF05A45FF7;// 0x1D78(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BE78898A4D2FE07C369016B7C304D6DA7;// 0x1DE8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_DF1B035645DA54E9BEB01795CF1F3349;// 0x1E30(0x00D8)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_AEA08283435E57937A36919828977C1B;// 0x1F08(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_9F92073B43DC28639762B29D6573B3DA;// 0x1F40(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_66CADA3A425A410162602392197CE66D;// 0x1FB8(0x00E0)
	unsigned char                                      UnknownData02[0x8];                                       // 0x2098(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3261A6BF47E010416874D4807FD779AC6;// 0x20A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE68FD1849057912AEA27BBC7D0F74686;// 0x2120(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_571BD635448373FD9129E7841A35A4126;// 0x21A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D9F831C94A1B9834F0A6F9B29BB348266;// 0x2220(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9839D7D744BCBD7C571A71B855BC00E66;// 0x22A0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CBC5A51640CB56A5682D5A97A322E6F16;// 0x2310(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E194820E4C5D003931F537AE81A78EBA6;// 0x2358(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_003B5F6544E3DD14CB5A2BB4156D60E56;// 0x23C8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F1FE54B8459BA78AA61668BFBC86A3616;// 0x2410(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_39C3F97F4B2A391DA8D9CCB5C2459E186;// 0x2480(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6D52F616479BB3BEDD6570AEF05A45FF6;// 0x24C8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BE78898A4D2FE07C369016B7C304D6DA6;// 0x2538(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_7E06C7E04E440A95E50E8FB296C32988;// 0x2580(0x00D8)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_F46526F54A9F28FF1DB1098C770254E9;// 0x2658(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_C32582F844A16F4AE6C94792C1654512;// 0x2690(0x0078)
	unsigned char                                      UnknownData03[0x8];                                       // 0x2708(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3261A6BF47E010416874D4807FD779AC5;// 0x2710(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE68FD1849057912AEA27BBC7D0F74685;// 0x2790(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_571BD635448373FD9129E7841A35A4125;// 0x2810(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D9F831C94A1B9834F0A6F9B29BB348265;// 0x2890(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9839D7D744BCBD7C571A71B855BC00E65;// 0x2910(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CBC5A51640CB56A5682D5A97A322E6F15;// 0x2980(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E194820E4C5D003931F537AE81A78EBA5;// 0x29C8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_003B5F6544E3DD14CB5A2BB4156D60E55;// 0x2A38(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F1FE54B8459BA78AA61668BFBC86A3615;// 0x2A80(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_39C3F97F4B2A391DA8D9CCB5C2459E185;// 0x2AF0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6D52F616479BB3BEDD6570AEF05A45FF5;// 0x2B38(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BE78898A4D2FE07C369016B7C304D6DA5;// 0x2BA8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D70908504D211838FA8B3B8ACE3AB03D;// 0x2BF0(0x00D8)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_BF43F29B486F53C5035FB4838BC0A396;// 0x2CC8(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_9CAB2BF246B64F3126FFEB91DD6C0324;// 0x2D00(0x0078)
	unsigned char                                      UnknownData04[0x8];                                       // 0x2D78(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3261A6BF47E010416874D4807FD779AC4;// 0x2D80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE68FD1849057912AEA27BBC7D0F74684;// 0x2E00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_571BD635448373FD9129E7841A35A4124;// 0x2E80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D9F831C94A1B9834F0A6F9B29BB348264;// 0x2F00(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9839D7D744BCBD7C571A71B855BC00E64;// 0x2F80(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CBC5A51640CB56A5682D5A97A322E6F14;// 0x2FF0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E194820E4C5D003931F537AE81A78EBA4;// 0x3038(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_003B5F6544E3DD14CB5A2BB4156D60E54;// 0x30A8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F1FE54B8459BA78AA61668BFBC86A3614;// 0x30F0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_39C3F97F4B2A391DA8D9CCB5C2459E184;// 0x3160(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6D52F616479BB3BEDD6570AEF05A45FF4;// 0x31A8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BE78898A4D2FE07C369016B7C304D6DA4;// 0x3218(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_7613C6E3469845BABFFF498404651987;// 0x3260(0x00D8)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_16366A4945FFFA647FD911A0B31C3025;// 0x3338(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_4726D1494842C05E2688A4BF6EDD641C;// 0x3370(0x0078)
	unsigned char                                      UnknownData05[0x8];                                       // 0x33E8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3261A6BF47E010416874D4807FD779AC3;// 0x33F0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE68FD1849057912AEA27BBC7D0F74683;// 0x3470(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_571BD635448373FD9129E7841A35A4123;// 0x34F0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D9F831C94A1B9834F0A6F9B29BB348263;// 0x3570(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9839D7D744BCBD7C571A71B855BC00E63;// 0x35F0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CBC5A51640CB56A5682D5A97A322E6F13;// 0x3660(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E194820E4C5D003931F537AE81A78EBA3;// 0x36A8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_003B5F6544E3DD14CB5A2BB4156D60E53;// 0x3718(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F1FE54B8459BA78AA61668BFBC86A3613;// 0x3760(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_39C3F97F4B2A391DA8D9CCB5C2459E183;// 0x37D0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6D52F616479BB3BEDD6570AEF05A45FF3;// 0x3818(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BE78898A4D2FE07C369016B7C304D6DA3;// 0x3888(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B22744AF4C8BED7A6029D18BC9520C0A;// 0x38D0(0x00D8)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_93A02EF84788CE0CCDF8CCA94B184086;// 0x39A8(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_A02FAB484D0A7C27A36962889E1C5E41;// 0x39E0(0x0078)
	unsigned char                                      UnknownData06[0x8];                                       // 0x3A58(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3261A6BF47E010416874D4807FD779AC2;// 0x3A60(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE68FD1849057912AEA27BBC7D0F74682;// 0x3AE0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_571BD635448373FD9129E7841A35A4122;// 0x3B60(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D9F831C94A1B9834F0A6F9B29BB348262;// 0x3BE0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9839D7D744BCBD7C571A71B855BC00E62;// 0x3C60(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CBC5A51640CB56A5682D5A97A322E6F12;// 0x3CD0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E194820E4C5D003931F537AE81A78EBA2;// 0x3D18(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_003B5F6544E3DD14CB5A2BB4156D60E52;// 0x3D88(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F1FE54B8459BA78AA61668BFBC86A3612;// 0x3DD0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_39C3F97F4B2A391DA8D9CCB5C2459E182;// 0x3E40(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6D52F616479BB3BEDD6570AEF05A45FF2;// 0x3E88(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BE78898A4D2FE07C369016B7C304D6DA2;// 0x3EF8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_65A215174ED5CAEDA4CDEE915DE31A6D;// 0x3F40(0x00D8)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_77D21E904AD031134EB1378FC416AD0E;// 0x4018(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_CAABA79B484855DDE00482BA1272242C;// 0x4050(0x0078)
	unsigned char                                      UnknownData07[0x8];                                       // 0x40C8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3261A6BF47E010416874D4807FD779AC;// 0x40D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE68FD1849057912AEA27BBC7D0F7468;// 0x4150(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_571BD635448373FD9129E7841A35A412;// 0x41D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D9F831C94A1B9834F0A6F9B29BB34826;// 0x4250(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9839D7D744BCBD7C571A71B855BC00E6;// 0x42D0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CBC5A51640CB56A5682D5A97A322E6F1;// 0x4340(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E194820E4C5D003931F537AE81A78EBA;// 0x4388(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_003B5F6544E3DD14CB5A2BB4156D60E5;// 0x43F8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F1FE54B8459BA78AA61668BFBC86A361;// 0x4440(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_39C3F97F4B2A391DA8D9CCB5C2459E18;// 0x44B0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6D52F616479BB3BEDD6570AEF05A45FF;// 0x44F8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BE78898A4D2FE07C369016B7C304D6DA;// 0x4568(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_AC7AB00244104241FA25DDAF899686E4;// 0x45B0(0x00D8)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_D5EF6A0D45F14DDAF2EE67986318B741;// 0x4688(0x0038)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_8F1C484843A58D9AD3606980B9B842DC;// 0x46C0(0x0078)
	unsigned char                                      UnknownData08[0x8];                                       // 0x4738(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3380623A4E55650C36FE478F59FE75E36;// 0x4740(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5FF4BBE340E6A4FB4CBC1688603F29E26;// 0x47C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0B35EB4C4BECA0F43A3876B7A4CF9F9A6;// 0x4840(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4BBDDE5E4D21BFE673AA4E8EC58E8C4B6;// 0x48C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_344A90C94C0B0542A652809B787F26566;// 0x4940(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_90AF36E047D94C471934F4ACE359EBFA6;// 0x49C0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6198EFBF4320DA3221114E8AE2DD5C8C6;// 0x4A30(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_73FECFE04339576AC17D90AFA95EC6186;// 0x4A78(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7FBA0B5948FA3888292AD18863C5E8FD6;// 0x4AE8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7023FE3C450460FA084AABA330B2BFB86;// 0x4B30(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2870FF664E27EE2072F16998D3AF8A6F6;// 0x4BA0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3CAF326441CDB973CD95AAAD976708116;// 0x4BE8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9F6C0F03495498D5A359D39A902EC8356;// 0x4C58(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FE25CB0E4FD9FA7AB87211A396567DF1;// 0x4CA0(0x00D8)
	unsigned char                                      UnknownData09[0x8];                                       // 0x4D78(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3380623A4E55650C36FE478F59FE75E35;// 0x4D80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5FF4BBE340E6A4FB4CBC1688603F29E25;// 0x4E00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0B35EB4C4BECA0F43A3876B7A4CF9F9A5;// 0x4E80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4BBDDE5E4D21BFE673AA4E8EC58E8C4B5;// 0x4F00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_344A90C94C0B0542A652809B787F26565;// 0x4F80(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_90AF36E047D94C471934F4ACE359EBFA5;// 0x5000(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6198EFBF4320DA3221114E8AE2DD5C8C5;// 0x5070(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_73FECFE04339576AC17D90AFA95EC6185;// 0x50B8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7FBA0B5948FA3888292AD18863C5E8FD5;// 0x5128(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7023FE3C450460FA084AABA330B2BFB85;// 0x5170(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2870FF664E27EE2072F16998D3AF8A6F5;// 0x51E0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3CAF326441CDB973CD95AAAD976708115;// 0x5228(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9F6C0F03495498D5A359D39A902EC8355;// 0x5298(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_AAE8863943324C0CB5174591F62FDB82;// 0x52E0(0x00D8)
	unsigned char                                      UnknownData10[0x8];                                       // 0x53B8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3380623A4E55650C36FE478F59FE75E34;// 0x53C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5FF4BBE340E6A4FB4CBC1688603F29E24;// 0x5440(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0B35EB4C4BECA0F43A3876B7A4CF9F9A4;// 0x54C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4BBDDE5E4D21BFE673AA4E8EC58E8C4B4;// 0x5540(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_344A90C94C0B0542A652809B787F26564;// 0x55C0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_90AF36E047D94C471934F4ACE359EBFA4;// 0x5640(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6198EFBF4320DA3221114E8AE2DD5C8C4;// 0x56B0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_73FECFE04339576AC17D90AFA95EC6184;// 0x56F8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7FBA0B5948FA3888292AD18863C5E8FD4;// 0x5768(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7023FE3C450460FA084AABA330B2BFB84;// 0x57B0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2870FF664E27EE2072F16998D3AF8A6F4;// 0x5820(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3CAF326441CDB973CD95AAAD976708114;// 0x5868(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9F6C0F03495498D5A359D39A902EC8354;// 0x58D8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6DFC5114453A72A10BCDC092553C199B;// 0x5920(0x00D8)
	unsigned char                                      UnknownData11[0x8];                                       // 0x59F8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3380623A4E55650C36FE478F59FE75E33;// 0x5A00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5FF4BBE340E6A4FB4CBC1688603F29E23;// 0x5A80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0B35EB4C4BECA0F43A3876B7A4CF9F9A3;// 0x5B00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4BBDDE5E4D21BFE673AA4E8EC58E8C4B3;// 0x5B80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_344A90C94C0B0542A652809B787F26563;// 0x5C00(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_90AF36E047D94C471934F4ACE359EBFA3;// 0x5C80(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6198EFBF4320DA3221114E8AE2DD5C8C3;// 0x5CF0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_73FECFE04339576AC17D90AFA95EC6183;// 0x5D38(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7FBA0B5948FA3888292AD18863C5E8FD3;// 0x5DA8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7023FE3C450460FA084AABA330B2BFB83;// 0x5DF0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2870FF664E27EE2072F16998D3AF8A6F3;// 0x5E60(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3CAF326441CDB973CD95AAAD976708113;// 0x5EA8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9F6C0F03495498D5A359D39A902EC8353;// 0x5F18(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_A17450AC4B7B61D423EA3C97A0D953DA;// 0x5F60(0x00D8)
	unsigned char                                      UnknownData12[0x8];                                       // 0x6038(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3380623A4E55650C36FE478F59FE75E32;// 0x6040(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5FF4BBE340E6A4FB4CBC1688603F29E22;// 0x60C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0B35EB4C4BECA0F43A3876B7A4CF9F9A2;// 0x6140(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4BBDDE5E4D21BFE673AA4E8EC58E8C4B2;// 0x61C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_344A90C94C0B0542A652809B787F26562;// 0x6240(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_90AF36E047D94C471934F4ACE359EBFA2;// 0x62C0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6198EFBF4320DA3221114E8AE2DD5C8C2;// 0x6330(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_73FECFE04339576AC17D90AFA95EC6182;// 0x6378(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7FBA0B5948FA3888292AD18863C5E8FD2;// 0x63E8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7023FE3C450460FA084AABA330B2BFB82;// 0x6430(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2870FF664E27EE2072F16998D3AF8A6F2;// 0x64A0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3CAF326441CDB973CD95AAAD976708112;// 0x64E8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9F6C0F03495498D5A359D39A902EC8352;// 0x6558(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_38BFB7FE4D4B6D20AF68FD81D07BF803;// 0x65A0(0x00D8)
	unsigned char                                      UnknownData13[0x8];                                       // 0x6678(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3380623A4E55650C36FE478F59FE75E3;// 0x6680(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5FF4BBE340E6A4FB4CBC1688603F29E2;// 0x6700(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0B35EB4C4BECA0F43A3876B7A4CF9F9A;// 0x6780(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4BBDDE5E4D21BFE673AA4E8EC58E8C4B;// 0x6800(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_344A90C94C0B0542A652809B787F2656;// 0x6880(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_90AF36E047D94C471934F4ACE359EBFA;// 0x6900(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6198EFBF4320DA3221114E8AE2DD5C8C;// 0x6970(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_73FECFE04339576AC17D90AFA95EC618;// 0x69B8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7FBA0B5948FA3888292AD18863C5E8FD;// 0x6A28(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7023FE3C450460FA084AABA330B2BFB8;// 0x6A70(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2870FF664E27EE2072F16998D3AF8A6F;// 0x6AE0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3CAF326441CDB973CD95AAAD97670811;// 0x6B28(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9F6C0F03495498D5A359D39A902EC835;// 0x6B98(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FFE8EFAF486F3E7802263B9317D10414;// 0x6BE0(0x00D8)
	bool                                               HeartRaised;                                              // 0x6CB8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData14[0x7];                                       // 0x6CB9(0x0007) MISSED OFFSET
	TArray<bool>                                       ArchRaised;                                               // 0x6CC0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass GateStation_AnimBP.GateStation_AnimBP_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_GateStation_AnimBP_AnimGraphNode_TransitionResult_AE68FD1849057912AEA27BBC7D0F7468_2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GateStation_AnimBP_AnimGraphNode_TransitionResult_AE68FD1849057912AEA27BBC7D0F7468_1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GateStation_AnimBP_AnimGraphNode_TransitionResult_D9F831C94A1B9834F0A6F9B29BB34826_1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GateStation_AnimBP_AnimGraphNode_TransitionResult_D9F831C94A1B9834F0A6F9B29BB34826_3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GateStation_AnimBP_AnimGraphNode_TransitionResult_AE68FD1849057912AEA27BBC7D0F7468();
