#pragma once

// Name: Astroneer-SDK, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass OGSuit_AnimBlueprint.OGSuit_AnimBlueprint_C
// 0x4C71 (0x5041 - 0x03D0)
class UOGSuit_AnimBlueprint_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x03D0(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_4A0689244AF4A11A0AC4D5A299FB91E2;      // 0x03D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AC8D61A241F7F941872BA0B7FC9DE141;// 0x0420(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1735929B49DC77F1AC18038089545E8F;// 0x04A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_660BF18841F8849F783876A5C08FEC8D;// 0x0520(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7F9A36E744D70D5D57AA41B2B03F25D9;// 0x05A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1A1D16084A10FA1C40CB05BFC7071698;// 0x0620(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CCF8F1604A29DA5C1522B8805486A0E5;// 0x06A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0F29ADBB4A102C398C428E9D8A45FB31;// 0x0720(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_80DE22C242F5B4A23EB65B80CCAE441F;// 0x07A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_04F7977941F785B640D5F88E8CD05344;// 0x0820(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_062B23074D5087EDC3B602A6B0A964D9;// 0x08A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AEECF0CF4540169C154111B2703DF713;// 0x0920(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_71A8DDD44808CBE7EC6F20A623E801ED;// 0x09A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DAD6A54D40CC4AF7EE175C88F3EAEC95;// 0x0A20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F328C45844154F49C06A51945DBE1369;// 0x0AA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0EB5CD5940C966B18BFFF69E725069CD;// 0x0B20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AD49ACF742F6A33E4D520A82B8832975;// 0x0BA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_86AB3651422A811F9084BCA16EDE0AE7;// 0x0C20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_018DDB9640A76E09ED42A880623AF7FB;// 0x0CA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A907F6054FA45B4ECED08A826CFE6BE8;// 0x0D20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_08ABFAF24643AB70CFA0C7871EEEBC46;// 0x0DA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8F3D75A44287C71F7C2BF5A475246D15;// 0x0E20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ECB1EC00477432020D8D22BC4B4F37EE;// 0x0EA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DFBCD73A4456693A539F7EB35F3A855F;// 0x0F20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6863295D479E67FD44F48D9AB54E10B5;// 0x0FA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF2AE0F34E1BD5743567189C0EE97DF3;// 0x1020(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_389B6FC845CFCF23504FB58DC7484824;// 0x10A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6ED46B6842F1A418BE61669D18E20424;// 0x1120(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E813335C4AD1C8E80020CEB7CBAEA276;// 0x11A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6E36879D46AE34AEA72E36BA9F1FEA54;// 0x1220(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CB74516642DA2CE666F75797525E6D70;// 0x12A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6B4040184116E2666CC4F3A37B9C064F;// 0x1320(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C5C1A9B648489F2CDE11819A5F913ABE;// 0x13A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FC7577EE47693D7DC251DBAD12C2A59F;// 0x1420(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AA9F5F2340D321F9D8A821826AFDF5B1;// 0x14A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_371959E14A4752B66A5025BF3C1909D1;// 0x1520(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E52DC5CE4A97E6FE229424B19F487C09;// 0x15A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2B4F85254FE1E83382310FB81DA0016C;// 0x1620(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9719600B469E6C2C7DBAC58C6F61A5F9;// 0x16A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2DECD4E8435B8A8055165BB40D437A53;// 0x1720(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9F5A67F9499B5A4749E135ADFDCEFCA1;// 0x17A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F97813D749E39EF42C068BA0DFC82F6F;// 0x1820(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9AF341024A4259B7DB73FEB113044FF5;// 0x18A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A013CBC746898DC456DA08B65F5C31C2;// 0x1920(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_039C094C41E34EAD4799A09845B2B00E;// 0x19A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A8FBB7944A7A1FEFC045A1BF340733D4;// 0x1A20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73C5598349DE5AC2D3190ABCD110701C;// 0x1AA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4B80FCED4753F1622CE558A71F19A8DB;// 0x1B20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0799CFB940A078F4197B22A58BA4445B;// 0x1BA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_75548EF74D01E172D02603AF702F44FF;// 0x1C20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_901722124AECDF1ECDE862ACD1D4512C;// 0x1CA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0C5C600843A822A106AD5585B7EE0ECE;// 0x1D20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_31DD964B44E29F3264BCC7B355359C6A;// 0x1DA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_202CA0934EA98DAEF560418F4E5676FE;// 0x1E20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CD21BACE48BF9E53F0A4629187FCC30C;// 0x1EA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9DB811394DCC6089D4849B9E1AC3985D;// 0x1F20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2B26D0984C33FF722888ECAAD6CCDAC3;// 0x1FA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE272913474F434C189F4A9D4D381F2B;// 0x2020(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BC838BBB479DEF10F13E83BECE7009ED;// 0x20A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BD8638B64C7D5877EFCAAE93C37B2FA6;// 0x2120(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A18A131C4E494198CA925F9E5D46C860;// 0x21A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BB8AF96F468B04D5DCF443AD95E36E07;// 0x2220(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7CE84BE4409E873DA21BDE8BA638D2C4;// 0x22A0(0x0080)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8B6E53F34ECB76FFE67EFE8C4E2070AE;// 0x2320(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0AE90E1C492E80BC94D710BEBF88F03A;// 0x2448(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_92EB6688418E643D9BAE539EFA8F9B8E;// 0x2570(0x0128)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_F09E865A49AA3699DA1D5CB3C5A14A09;// 0x2698(0x0078)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_750301764464DDB242A127A4C7A16EB8;// 0x2710(0x0078)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_702F077E48EE1A37454CC3BBE1833EA9;// 0x2788(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CC5AF3574A3E4327DA7582B89792FB81;// 0x27D0(0x00B8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_E8E47D7543BFF14E6A43D8A5468D7F9E;// 0x2888(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ECD8976647D6E7AB48F5098A7E34D367;// 0x28D0(0x0048)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_5BDF66B4468ECFC9C2435EA2BC77E7BF;// 0x2918(0x0078)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_26635D784EDA591BD67807BCF0D59684;// 0x2990(0x0078)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_CD311AE646060B38D4D737BF0EA2042B;// 0x2A08(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_6F6D2A644074B89B86BE629C6DDCEC0F;// 0x2B30(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_69B6040D4EAF4277B7BBBF89E7E74C96;// 0x2C58(0x0128)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_F04EF4014E70573A1EBB1BA4DE0DA77B;// 0x2D80(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8CE0B57040CC72F15294BDB15BFB4850;// 0x2DC8(0x00B8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_6F5776B546D74C8497FAA89F23E444B9;// 0x2E80(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DDCA4F8944870110DC4AAA99F69DA837;// 0x2EC8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9007899F43D04D7B47BDF08C34C5BA5F;// 0x2F10(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6119DCFF45EB72FC9C54DF84DF532C8E;// 0x2F80(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_97E5A20F43CE3116B0D756B2A18856A4;// 0x2FC8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_228532FB4BF36FC7DE64F4BCC17B9421;// 0x3038(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_88A5282747615824B6675488E60A6F8B;// 0x3080(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E9D46A2F4740D314DBA7CEB26C8B4509;// 0x30F0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E806434E48CD35945F2845AEAD7DB4C2;// 0x3138(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CA3F6C46496476E5B67511BBC2BB0EF3;// 0x31A8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_00E46FDC46ACB159F205BC80FBB37863;// 0x31F0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0CF68D32457DFE1B755E38968DA545DB;// 0x3260(0x0048)
	unsigned char                                      UnknownData00[0x8];                                       // 0x32A8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_399E1111458F32D638513B950E1E2606;// 0x32B0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_245B093743FE33DCA588FC9486AD9F60;// 0x3330(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_023C4EA64C8374A7DB9745A0FAAB0793;// 0x33A0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2A4BE14947E63CC3A09657A983473D36;// 0x33E8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_73BA42C740B43DDB1D84DFA2D355FB98;// 0x3458(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C603E58648B0B9172682328DECBFF61A;// 0x34A0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_65B2330541A151D197EADDB46E6BCAA4;// 0x3510(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1F6397324E5BC94BA13BCFB894677DF0;// 0x3558(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7327C50A404E68070562028CA3FC926A;// 0x35C8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_912A5FA3462E3E166983EF943638284D;// 0x3610(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CBF1067C4A7B98B15F128CAC1F68F6F0;// 0x3680(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AAC6F3474AB058CB2E22AEA41C9140D3;// 0x36C8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CF2AD30344C7DE3386361AA415C9EAEE;// 0x3738(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AD3B410849D41344F827E682B61977CA;// 0x3780(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A284F96E486C27F04884C0A0E5A792D2;// 0x37F0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_414542D3420263FD95CEF586D01C30B5;// 0x3838(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A98F917F422F0009AFE5E1AA832BFE5D;// 0x38A8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8B9152C145005D981896C2895BDF9AA4;// 0x38F0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4B7AFAF245465D0A025918BDA8EBFCB7;// 0x3960(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9B89EFFD41A6EAB54BECA39C1051AD60;// 0x39A8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3A73B5E042BD22E359C5BCA28F9E70ED;// 0x3A18(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FAC8AB2C4DDD4E7843E5E9B3FE30F9BC;// 0x3A60(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F4ECFC35411FD09E88D280ADA9D32C4F;// 0x3AD0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4D68DBD3472045A18200D193A19186D5;// 0x3B18(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F65D3BB04671BB2CFD03AE9D73B42369;// 0x3B88(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F3959E6E4ED396783FB1FAB372C01968;// 0x3BD0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7E0AA1644DDB7C64866F10BF29FE2F94;// 0x3C50(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_633AB5F842E3054C6B580580E004FD42;// 0x3CC0(0x0048)
	unsigned char                                      UnknownData01[0x8];                                       // 0x3D08(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_60670C424A1C5609B002E49E4E1B9493;// 0x3D10(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_92EC8ECE49B9FE23F3F230BADB2E3A03;// 0x3D90(0x0070)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_0E06E6B34AEB2B8A30F9B0BBC47230D0;// 0x3E00(0x0078)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_92CA91E24C2A1F6A50D8B89E731EDBA0;// 0x3E78(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B8C5056B4EB05B582A3A2580FA804626;// 0x3EC0(0x00B8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_38A905C74FDF4C04152B7784B8AD9677;// 0x3F78(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_827B12564F03C022520EC682D8EA900C;// 0x3FC0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D05B969843A253C5D0CD71936C019368;// 0x4030(0x0070)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_A173B0114DAC5F85D7A733B6675D2125;// 0x40A0(0x0078)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9C80A9D749B13388F59155A049C3DA77;// 0x4118(0x0048)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_4EDA626942860B2A37F991917102F3E1;// 0x4160(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_60CD85C64A62F0F119110B8CF556964D;// 0x41D8(0x0070)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_88B556E44A5225F29F7EECB81B2E6B9A;// 0x4248(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_BF8646DF40058B25DC6D808123ADF852;// 0x4290(0x00B8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_FA7378C94CBEDB1A5D68C7B8C1DC0460;// 0x4348(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A18A0E94649ABD0A95B6B863EB172DF;// 0x4390(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F62493674F50F1ED7B9FCBB42AEE21CC;// 0x4400(0x0070)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_C334788F4B60CFDF6625E2AE8A772113;// 0x4470(0x0078)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7EA0E7E04625BA3B437403930916A791;// 0x44E8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_13240DB54DA9AD2251FE4C926F026D3E;// 0x4530(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CF338B6A4CA9667B55D5DC80365549EB;// 0x4578(0x00B8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_00911E9D47E2AD41C3F920A27A20BC98;// 0x4630(0x0048)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_8DD36B464B81058EB29C3DB57BBEC426;// 0x4678(0x0078)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F5B07E72423852969BE175ACD93E5B7C;// 0x46F0(0x0128)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_ADD1F06F41B75703A761908B41510E9D;// 0x4818(0x0078)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_910450EB49202DED5DA8B8B2AF607CD2;// 0x4890(0x0078)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_19B0DAA843AB13F9F6DCE5959AFB5B2A;// 0x4908(0x0078)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8C727C2F417755230BB15FBCA9AA3D81;// 0x4980(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7F0B549C4C0A1134BF75E19C4E21F7ED;// 0x4AA8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_994DB1CB42AFCBCA885D10AF486FD2FD;// 0x4BD0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BB9262A642620D28807D62AD8C532FFE;// 0x4CF8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2C3ADA4E4A0BB229AEFFE284E76FCDA5;// 0x4E20(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_E24599314E98EAA1CE71ED8DF5FD2F3B;// 0x4E68(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_F9761310415AD3387F5067B3B1E2A065;      // 0x4F40(0x0068)
	float                                              Strafe;                                                   // 0x4FA8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Speed;                                                    // 0x4FAC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Using_Tool;                                               // 0x4FB0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Focusing;                                                 // 0x4FB4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Sliding;                                                  // 0x4FB8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Wind;                                                     // 0x4FBC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Head_Yaw;                                                 // 0x4FC0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Head_Pitch;                                               // 0x4FC4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     Right_Foot_Effector;                                      // 0x4FC8(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     Right_Foot_Joint;                                         // 0x4FD4(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	bool                                               Jumped;                                                   // 0x4FE0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EAstroMovementMode                                 MovementMode;                                             // 0x4FE1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x4FE2(0x0002) MISSED OFFSET
	float                                              Float_Animation_Rate;                                     // 0x4FE4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Driving;                                                  // 0x4FE8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x4FE9(0x0003) MISSED OFFSET
	int                                                Loco_Anim;                                                // 0x4FEC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class AAstroCharacter*                             Astro;                                                    // 0x4FF0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    HeadRotator;                                              // 0x4FF8(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	float                                              AbsoluteSpeed;                                            // 0x5004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              UnclampedSpeed;                                           // 0x5008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ClampedSpeed;                                             // 0x500C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SpeedMultiplied;                                          // 0x5010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              UnclampedStrafe;                                          // 0x5014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WindInterp;                                               // 0x5018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              UsingToolDivided;                                         // 0x501C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FallingNotJumped;                                         // 0x5020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               WalkingNotJumped;                                         // 0x5021(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsWalking;                                                // 0x5022(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsFalling;                                                // 0x5023(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsFlying;                                                 // 0x5024(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LocoAnim0NotEqual;                                        // 0x5025(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LocoAim1;                                                 // 0x5026(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LocoAnim2;                                                // 0x5027(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LocoAnim3;                                                // 0x5028(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LocoAnim7;                                                // 0x5029(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LocoAnim8;                                                // 0x502A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LocoAnim13;                                               // 0x502B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LocoAnim14;                                               // 0x502C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LocoAnim11;                                               // 0x502D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LocoAnim12;                                               // 0x502E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LocoAnim0;                                                // 0x502F(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LocoAnim15;                                               // 0x5030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LocoAnim20;                                               // 0x5031(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LocoAnim21;                                               // 0x5032(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LocoAnim22;                                               // 0x5033(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LocoAnim23;                                               // 0x5034(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsSliding;                                                // 0x5035(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x2];                                       // 0x5036(0x0002) MISSED OFFSET
	float                                              HeavyCarrying;                                            // 0x5038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HeavyCarryDivide;                                         // 0x503C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsCreativeFlight;                                         // 0x5040(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass OGSuit_AnimBlueprint.OGSuit_AnimBlueprint_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_OGSuit_AnimBlueprint_AnimGraphNode_TransitionResult_901722124AECDF1ECDE862ACD1D4512C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_OGSuit_AnimBlueprint_AnimGraphNode_TransitionResult_75548EF74D01E172D02603AF702F44FF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_OGSuit_AnimBlueprint_AnimGraphNode_TransitionResult_0C5C600843A822A106AD5585B7EE0ECE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_OGSuit_AnimBlueprint_AnimGraphNode_TransitionResult_31DD964B44E29F3264BCC7B355359C6A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_OGSuit_AnimBlueprint_AnimGraphNode_TransitionResult_6E36879D46AE34AEA72E36BA9F1FEA54();
