#pragma once

// Name: Astroneer-SDK, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass RoverT2B_AnimBP.RoverT2B_AnimBP_C
// 0x1BCB (0x20DB - 0x0510)
class URoverT2B_AnimBP_C : public UWheeledChassisAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0510(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_C54CCA4348748D0BDA4FDFAE80157DF8;      // 0x0518(0x0048)
	struct FAnimNode_MeshSpaceRefPose                  AnimGraphNode_MeshRefPose_86A9093743815EC8A2540882F3377703;// 0x0560(0x0030)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DDF719984EAE558331C6228FF7414C1D;// 0x0590(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_86C512CC402CD9CD9CB3ADBABDCFA732;// 0x0648(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_53992A44419B2B9EC6C0E9A52B8C5C9D;// 0x0700(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5CF7459142E11020D7FA00864A28AB95;// 0x07B8(0x00B8)
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_7C788D7B4F621C45B1E02881701E120B;    // 0x0870(0x01A0)
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_83727C7D4472624BE0C32F8E21493401;    // 0x0A10(0x01A0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_2E14A76B4AC19A5F74B19D9B50E0AAE9;  // 0x0BB0(0x00A8)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_4FB7EDAF43DE603C78A08CB157D0E600;  // 0x0C58(0x00A8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7464CB684CA1F3BA5D15CBAE16FEE90F;// 0x0D00(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_0C679E324571E1BCE91E24939ECDE5B4;// 0x0DB8(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4DD0AD364EE5C7D6255A40A50EDC3F93;// 0x0E70(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4CA6FE0F4A49494B756F76812A59D9BE;// 0x0F28(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4C473EEE42C1FAEAD367E9B620F5EBBF;// 0x0FE0(0x00B8)
	unsigned char                                      UnknownData00[0x8];                                       // 0x1098(0x0008) MISSED OFFSET
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_2388288F48A16E52EBD03196684A03F7;    // 0x10A0(0x01A0)
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_87D974864F4D0EFEFB5021A15BDBF6F3;    // 0x1240(0x01A0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_EAC12F17468A39D10A3441892F1C1FD9;  // 0x13E0(0x00A8)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_69C757E24A77619D48AA1498CF1BBE92;  // 0x1488(0x00A8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8FFDFAEC4D3602DDD66872A4C88380B9;// 0x1530(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2FE80E634BA31A302C758ABFB068C685;// 0x15E8(0x00B8)
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_4B527C0B41A123B6D8CEDEB373B8CEDB;    // 0x16A0(0x01A0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_1B2EEEE24C6DBBF26CA558A8E0E12382;  // 0x1840(0x00A8)
	unsigned char                                      UnknownData01[0x8];                                       // 0x18E8(0x0008) MISSED OFFSET
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_7CCC682F463F49BA7CEB7FB0086C874E;    // 0x18F0(0x01A0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_CB34B3924AEA502A252236A78E638DB5;  // 0x1A90(0x00A8)
	unsigned char                                      UnknownData02[0x8];                                       // 0x1B38(0x0008) MISSED OFFSET
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_D8684FE243079DB9337611992C7EC153;    // 0x1B40(0x01A0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_DAA633924F8C5A6870A8B3A59099A6DC;  // 0x1CE0(0x00A8)
	unsigned char                                      UnknownData03[0x8];                                       // 0x1D88(0x0008) MISSED OFFSET
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_1677519A44C976D1E21062BE08836BB3;    // 0x1D90(0x01A0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_D0CA61C9443A92E4505B6BBFF2EA0CF3;  // 0x1F30(0x00A8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_ACD99AD74AE45682B54FE7A5D63A9BC1;// 0x1FD8(0x00B8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7A16BF334232EA86760C4FAA613DCF3B;// 0x2090(0x0048)
	bool                                               IsInMotion;                                               // 0x20D8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               WheelsAreTurning;                                         // 0x20D9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsSuspensionInitialized;                                  // 0x20DA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass RoverT2B_AnimBP.RoverT2B_AnimBP_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_RoverT2B_AnimBP_AnimGraphNode_ModifyBone_4C473EEE42C1FAEAD367E9B620F5EBBF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RoverT2B_AnimBP_AnimGraphNode_ModifyBone_8FFDFAEC4D3602DDD66872A4C88380B9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RoverT2B_AnimBP_AnimGraphNode_ModifyBone_4CA6FE0F4A49494B756F76812A59D9BE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RoverT2B_AnimBP_AnimGraphNode_ModifyBone_2FE80E634BA31A302C758ABFB068C685();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RoverT2B_AnimBP_AnimGraphNode_ModifyBone_ACD99AD74AE45682B54FE7A5D63A9BC1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RoverT2B_AnimBP_AnimGraphNode_ModifyBone_4DD0AD364EE5C7D6255A40A50EDC3F93();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RoverT2B_AnimBP_AnimGraphNode_ModifyBone_0C679E324571E1BCE91E24939ECDE5B4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RoverT2B_AnimBP_AnimGraphNode_ModifyBone_7464CB684CA1F3BA5D15CBAE16FEE90F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RoverT2B_AnimBP_AnimGraphNode_ModifyBone_5CF7459142E11020D7FA00864A28AB95();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RoverT2B_AnimBP_AnimGraphNode_ModifyBone_53992A44419B2B9EC6C0E9A52B8C5C9D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RoverT2B_AnimBP_AnimGraphNode_ModifyBone_86C512CC402CD9CD9CB3ADBABDCFA732();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RoverT2B_AnimBP_AnimGraphNode_ModifyBone_DDF719984EAE558331C6228FF7414C1D();
	void BlueprintBeginPlay();
	void HandleMovementStateChanged(bool bIsMoving);
	void HandleRoverWheelSteerAnimStateChanged(bool bWheelsAreTurning);
	void UpdateAnimationTickability();
	void ExecuteUbergraph_RoverT2B_AnimBP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
