#pragma once

// Name: Astroneer-SDK, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Scanner_Probe_bp.Scanner_Probe_bp_C
// 0x15D0 (0x19A0 - 0x03D0)
class UScanner_Probe_bp_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x03D0(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_EEC1F3664F7BBEA51C6375867ACC533D;      // 0x03D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9D1E2C6148473044228A0DB7B1F0C00A;// 0x0420(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A9288CC84F6EB8441AEAC684203EE264;// 0x04A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BBD4F33B49020DFE460561B26DD881D4;// 0x0520(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FC35ADAF4B1CDC6C91A2008E2139C3A9;// 0x05A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3DFEF8DB4A1D4E96AA042DAB3A7041CF;// 0x0620(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D49CE58A42F7F2A4E060AC9B7B05E2DA;// 0x06A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB5ECFF74DCD153D035BF59F2ABBF507;// 0x0720(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F175026F4E3DAD12346746B34092DB2C;// 0x07A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3FC39EF143D50C04155F398BD1EE06AF;// 0x0820(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FB0BC10A40BD0EA8AA803C84A1901202;// 0x08A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_765970834C25F114F0A141BD89C23C8C;// 0x0920(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_86359781478F14F818113882232E12C0;// 0x09A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0EB2633D4C17B99CDC6524B933A0D32B;// 0x0A20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_79581458434079215AF1478266F641BA;// 0x0AA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2B9848FA4A206C0205AA5DABC1F26F12;// 0x0B20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_986C80F045B4F0D88C5FD0AA80BFF1A5;// 0x0BA0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_45BB9218471EE28F9F7FE795BD425FF02;// 0x0C20(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1D16FF67467BC217C20186BA800CAE592;// 0x0C90(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_656F371B4830881167E58AAFF489E1CD;// 0x0CD8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B40DD8B54A29A1260CAA93B49978317C;// 0x0D48(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3ABB3BFA476CA53FF0720CAAB7793DE4;// 0x0D90(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A50525243A22BA68823D4AF506094AA;// 0x0E00(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1A64B1AA4F64448D15E01AA731F4F400;// 0x0E48(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0C73755444F005E321F0B9B5D580AA7F;// 0x0EB8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_1B6E3B0F4035D5947707A3BF44F9158D;// 0x0F00(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_BCBF5F4442F266734513D7894020E5C8;// 0x0F48(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C5F31AB949FEB7CF95308E94080D725C;// 0x0F90(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_992AF52145D2A96F72677FA7DA41C4FA;// 0x1048(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_09BDF3BC4A8C8EB88FBDC89749D8AF80;// 0x10B8(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_A807D2DB41A48AABFCA3F39DBAA7C026;// 0x1100(0x00B8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_45BB9218471EE28F9F7FE795BD425FF0;// 0x11B8(0x0070)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_1B47FE19469DF8A6A13E8A873F4C0074;// 0x1228(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_69EB7F204DCA734CB3AB50AB2510285C;// 0x1270(0x00B8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_D40B37AB4B557E7FB61A51BA7D3D7A63;// 0x1328(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CEECC92E4C7B5AEA72F3DBA3AEBB8B1D;// 0x1370(0x00B8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1D16FF67467BC217C20186BA800CAE59;// 0x1428(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EC1022F04D694BDFC85AA7ABFD4E42D2;// 0x1470(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D5E8E5D446F228B9781377AABA4C3267;// 0x14E0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F39EA5F6491A8485A77B1284376011B1;// 0x1528(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_62A0B06F479E2CAF6F973E9E115E1644;// 0x1598(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3EE9E4A845776CC9F4CD50895D108EF8;// 0x15E0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_03F859604A068B0C3DD1C28A78F9E7E7;// 0x1650(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E925A80A45E30F49C8AAD99EF28C36C5;// 0x1698(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F4622B9F4763C7D042CCB4B6CEFAF99B;// 0x1708(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_DD34972140CC5A932C5E72A741363D21;// 0x1750(0x00D8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5292095A46B9DA421C1F149FE80A02DF;// 0x1828(0x00B8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_5B78CB884C598AD2BBE6BE8356BB33D8;// 0x18E0(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_FD1077434CF29AA833A1E4BD41C6090A;// 0x1928(0x0048)
	float                                              Yaw;                                                      // 0x1970(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Pitch;                                                    // 0x1974(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EScannerMode                                       ScannerMode;                                              // 0x1978(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EScannerTargetDistance                             TargetDistance;                                           // 0x1979(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x197A(0x0002) MISSED OFFSET
	struct FRotator                                    AuxSlotUpRotation;                                        // 0x197C(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxPitch;                                                 // 0x1988(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinPitch;                                                 // 0x198C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsUsingYawValue;                                          // 0x1990(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x1991(0x0003) MISSED OFFSET
	struct FRotator                                    AuxSlotForwardRotation;                                   // 0x1994(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Scanner_Probe_bp.Scanner_Probe_bp_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_Scanner_Probe_bp_AnimGraphNode_TransitionResult_DB5ECFF74DCD153D035BF59F2ABBF507();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Scanner_Probe_bp_AnimGraphNode_TransitionResult_765970834C25F114F0A141BD89C23C8C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Scanner_Probe_bp_AnimGraphNode_TransitionResult_86359781478F14F818113882232E12C0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Scanner_Probe_bp_AnimGraphNode_TransitionResult_0EB2633D4C17B99CDC6524B933A0D32B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Scanner_Probe_bp_AnimGraphNode_TransitionResult_79581458434079215AF1478266F641BA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Scanner_Probe_bp_AnimGraphNode_TransitionResult_D49CE58A42F7F2A4E060AC9B7B05E2DA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Scanner_Probe_bp_AnimGraphNode_TransitionResult_2B9848FA4A206C0205AA5DABC1F26F12();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Scanner_Probe_bp_AnimGraphNode_TransitionResult_986C80F045B4F0D88C5FD0AA80BFF1A5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Scanner_Probe_bp_AnimGraphNode_TransitionResult_3DFEF8DB4A1D4E96AA042DAB3A7041CF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Scanner_Probe_bp_AnimGraphNode_ModifyBone_C5F31AB949FEB7CF95308E94080D725C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Scanner_Probe_bp_AnimGraphNode_ModifyBone_A807D2DB41A48AABFCA3F39DBAA7C026();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Scanner_Probe_bp_AnimGraphNode_ModifyBone_69EB7F204DCA734CB3AB50AB2510285C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Scanner_Probe_bp_AnimGraphNode_ModifyBone_CEECC92E4C7B5AEA72F3DBA3AEBB8B1D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Scanner_Probe_bp_AnimGraphNode_TransitionResult_A9288CC84F6EB8441AEAC684203EE264();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Scanner_Probe_bp_AnimGraphNode_TransitionResult_9D1E2C6148473044228A0DB7B1F0C00A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Scanner_Probe_bp_AnimGraphNode_ModifyBone_5292095A46B9DA421C1F149FE80A02DF();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintBeginPlay();
	void AnimNotify_OnFullyAsleep();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Scanner_Probe_bp_AnimGraphNode_TransitionResult_F175026F4E3DAD12346746B34092DB2C();
	void PlacedInSlot();
	void SlotChanged();
	void AnimNotify_PostScanComplete();
	void AnimNotify_PreScanComplete();
	void OnBackpackAuxTransitionFinished();
	void ExecuteUbergraph_Scanner_Probe_bp(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
